// —————————————————————————————
// 1) รายการ PDF ทั้งหมด
// —————————————————————————————
const bulletins = [
    { title: "TSE-SVB-2015-01 การแก้ไขปัญหาเบาะนั่งตอนที่ 2 (ด้านซ้าย) มีเสียงดัง.pdf", year: 2015, file: "TSE-SVB-2015-01%20การแก้ไขปัญหาเบาะนั่งตอนที่%202%20(ด้านซ้าย)%20มีเสียงดัง.pdf" ,tags: ["เบาะนั่ง","เสียง"] },
    { title: "TSE-SVB-2015-02 การอัพเดทโปรแกรม DRM Reader (3.3.6).pdf", year: 2015, file: "TSE-SVB-2015-02%20การอัพเดทโปรแกรม%20DRM%20Reader%20(3.3.6).pdf" ,tags: ["DRM","อัพเดท","โปรแกรม"] },
    { title: "TSE-SVB-2015-03 การติดตั้งโปรแกรม G-IDSS เวอร์ชั่น 2.9.0.1.pdf", year: 2015, file: "TSE-SVB-2015-03%20การติดตั้งโปรแกรม%20G-IDSS%20เวอร์ชั่น%202.9.0.1.pdf" ,tags: ["GIDSS","โปรแกรม","อัพเดท"] },
    { title: "TSE-SVB-2015-04 ข้อแนะนำการเลือกใช้ขนาดไดชาร์จ (รถบรรทุกห้องเย็น).pdf", year: 2015, file: "TSE-SVB-2015-04%20ข้อแนะนำการเลือกใช้ขนาดไดชาร์จ%20(รถบรรทุกห้องเย็น).pdf" ,tags: ["ออลเตอร์เนเตอร์","ไดชาร์จ","ระบบไฟ"] },
    { title: "TSE-SVB-2015-05 แนะนำการตั้งค่าระบบเสียง สำหรับชุดลำโพง KENWOOD [MU-X Limited].pdf", year: 2015, file: "TSE-SVB-2015-05%20แนะนำการตั้งค่าระบบเสียง%20สำหรับชุดลำโพง%20KENWOOD%20[MU-X%20Limited].pdf" ,tags: ["ลำโพง","KENWOOD","วิทยุ"] },
    { title: "TSE-SVB-2015-06 แจ้งเพิ่มเติมรายการรหัสค่าแรงสำหรับงานบริการล้างตู้คอยล์เย็น.pdf", year: 2015, file: "TSE-SVB-2015-06%20แจ้งเพิ่มเติมรายการรหัสค่าแรงสำหรับงานบริการล้างตู้คอยล์เย็น.pdf" ,tags: ["ค่าแรง","LTG","ล้างตู้"] },
    { title: "TSE-SVB-2015-07 แนะนำข้อมูลการบำรุงรักษาชุดเกียร์สมูทเธอร์ SMOOTHER.pdf", year: 2015, file: "TSE-SVB-2015-07%20แนะนำข้อมูลการบำรุงรักษาชุดเกียร์สมูทเธอร์%20SMOOTHER.pdf" ,tags: ["Smoother","บำรุงรักษา","ระบบเกียร์"] },
    { title: "TSE-SVB-2015-08 อัพเดทโปรแกรม G-IDSS [24 เมษายน 2558].pdf", year: 2015, file: "TSE-SVB-2015-08%20อัพเดทโปรแกรม%20G-IDSS%20[24%20เมษายน%202558].pdf" ,tags: ["GIDSS","โปรแกรม","อัพเดท"] },
    { title: "TSE-SVB-2015-09 การแก้ไขปัญหากล่อง ECM ผิดปกติ [รหัสปัญหา P1621].pdf", year: 2015, file: "TSE-SVB-2015-09%20การแก้ไขปัญหากล่อง%20ECM%20ผิดปกติ%20[รหัสปัญหา%20P1621].pdf" ,tags: ["ECM","P1621"] },
    { title: "TSE-SVB-2015-10 ข้อแนะนำการเปลี่ยนชุดซ่อมคอยล์จุดระเบิด.pdf", year: 2015, file: "TSE-SVB-2015-10%20ข้อแนะนำการเปลี่ยนชุดซ่อมคอยล์จุดระเบิด.pdf" ,tags: ["คอยล์","ชุดซ่อม"] },
    { title: "TSE-SVB-2015-11 อัพเดทโปรแกรม G-IDSS [15 พฤษภาคม 2558].pdf", year: 2015, file: "TSE-SVB-2015-11%20อัพเดทโปรแกรม%20G-IDSS%20[15%20พฤษภาคม%202558].pdf" ,tags: ["GIDSS","โปรแกรม","อัพเดท"] },
    { title: "TSE-SVB-2015-13 แนะนำขั้นตอนการเปลี่ยนชุดซ่อมปั๊มน้ำ เครื่องยนต์ 6UZ1.pdf", year: 2015, file: "TSE-SVB-2015-13%20แนะนำขั้นตอนการเปลี่ยนชุดซ่อมปั๊มน้ำ%20เครื่องยนต์%206UZ1.pdf" ,tags: ["ระบบหล่อเย็น","ปั๊มน้ำ","6UZ1"] },
    { title: "TSE-SVB-2015-14 ข้อแนะนำการตรวจสอบระบบน้ำมันเชื้อเพลิง กรณีรถที่ใช้น้ำมันไบโอดีเซล B7.pdf", year: 2015, file: "TSE-SVB-2015-14%20ข้อแนะนำการตรวจสอบระบบน้ำมันเชื้อเพลิง%20กรณีรถที่ใช้น้ำมันไบโอดีเซล%20B7.pdf" ,tags: ["B7","ระบบน้ำมันเชื้อเพลิง"] },
    { title: "TSE-SVB-2015-15 แจ้งเพิ่มเติมเครื่องวิทยุอีซูซุ DVD พร้อมระบบนำทาง.pdf", year: 2015, file: "TSE-SVB-2015-15%20แจ้งเพิ่มเติมเครื่องวิทยุอีซูซุ%20DVD%20พร้อมระบบนำทาง.pdf" ,tags: ["วิทยุ","DVD","NAVI"] },
    { title: "TSE-SVB-2015-16_แนะนำการใช้งานวิทยุ_ISUZU_MEDIA_SOLUTIONS_(ฉบับย่อ).pdf", year: 2015, file: "TSE-SVB-2015-16_แนะนำการใช้งานวิทยุ_ISUZU_MEDIA_SOLUTIONS_(ฉบับย่อ).pdf" ,tags: ["วิทยุ"] },
    { title: "TSE-SVB-2015-17_อัพเดทโปรแกรม_G-IDSS_[1_กันยายน_2558].pdf", year: 2015, file: "TSE-SVB-2015-17_อัพเดทโปรแกรม_G-IDSS_[1_กันยายน_2558].pdf" ,tags: ["GIDSS","โปรแกรม","อัพเดท"] },
    { title: "TSE-SVB-2015-18 แนะนำการแก้ไขปัญหาแหนบมีเสียงดัง1.pdf", year: 2015, file: "TSE-SVB-2015-18%20แนะนำการแก้ไขปัญหาแหนบมีเสียงดัง1.pdf" ,tags: ["เสียง","แหนบ","ระบบรองรับน้ำหนัก"] },
    { title: "TSE-SVB-2015-19 อัพเดทโปรแกรม G-IDSS [09112015].pdf", year: 2015, file: "TSE-SVB-2015-19%20อัพเดทโปรแกรม%20G-IDSS%20[09112015].pdf" ,tags: ["GIDSS","โปรแกรม","อัพเดท"] },
    { title: "TSE-SVB-2015-20 แจ้งเปลี่ยนแปลงการใช้ชนิดน้ำมันเครื่อง สำหรับเครื่องยนต์ CNG ทุกรุ่น.pdf", year: 2015, file: "TSE-SVB-2015-20%20แจ้งเปลี่ยนแปลงการใช้ชนิดน้ำมันเครื่อง%20สำหรับเครื่องยนต์%20CNG%20ทุกรุ่น.pdf" ,tags: ["CNG","บำรุงรักษา","น้ำมันเครื่อง"] },
    { title: "TSE-SVB-2015-21 การแสดงข้อมูลระยะทางใช้งาน เกิน 1,000,000 กม.pdf", year: 2015, file: "TSE-SVB-2015-21%20การแสดงข้อมูลระยะทางใช้งาน%20เกิน%201,000,000%20กม.pdf" ,tags: ["หน้าปัด"] },
    { title: "TSE-SVB-2015-22 อัพเดทโปรแกรม G-IDSS [14122015].pdf", year: 2015, file: "TSE-SVB-2015-22%20อัพเดทโปรแกรม%20G-IDSS%20[14122015].pdf" ,tags: ["GIDSS","โปรแกรม","อัพเดท"] },
    { title: "TSE-SVB-2015-23 การเปลี่ยนแปลงระยะการบำรุงรักษารถบรรทุกอีซูซุ N และ F&G.pdf", year: 2015, file: "TSE-SVB-2015-23%20การเปลี่ยนแปลงระยะการบำรุงรักษารถบรรทุกอีซูซุ%20N%20และ%20F&G.pdf" ,tags: ["N","F&G","บำรุงรักษา"] },
    { title: "TSE-SVB-2015-24 ค่าแรงขันสกรูถ่ายน้ำมันเครื่อง รุ่น Blue Power.pdf", year: 2015, file: "TSE-SVB-2015-24%20ค่าแรงขันสกรูถ่ายน้ำมันเครื่อง%20รุ่น%20Blue%20Power.pdf" ,tags: ["ระบบเครื่องยนต์","สกรู","แรงขัน"] },
    { title: "TSE-SVB-2016-01 อัพเดทโปรแกรม G-IDSS [15012016].pdf", year: 2016, file: "TSE-SVB-2016-01%20อัพเดทโปรแกรม%20G-IDSS%20[15012016].pdf" ,tags: ["GIDSS","โปรแกรม","อัพเดท"] },
    { title: "TSE-SVB-2016-02 ปัญหาชุดมิเตอร์ทำงานผิดปกติ เนื่องจากการถอดฟิวส์.pdf", year: 2016, file: "TSE-SVB-2016-02%20ปัญหาชุดมิเตอร์ทำงานผิดปกติ%20เนื่องจากการถอดฟิวส์.pdf" ,tags: ["หน้าปัด","ฟิวส์"] },
    { title: "TSE-SVB-2016-03 ข้อแนะนำการใช้ชนิดน้ำยาหล่อเย็น (LLC) ใหม่.pdf", year: 2016, file: "TSE-SVB-2016-03%20ข้อแนะนำการใช้ชนิดน้ำยาหล่อเย็น%20(LLC)%20ใหม่.pdf" ,tags: ["น้ำหล่อเย็น","LLC","บำรุงรักษา"] },
    { title: "TSE-SVB-2016-04 แก้ไขปริมาณการใช้น้ำมันเครื่อง สำหรับเครื่องยนต์ รุ่น RZ4E-TC (Blue Power).pdf", year: 2016, file: "TSE-SVB-2016-04%20แก้ไขปริมาณการใช้น้ำมันเครื่อง%20สำหรับเครื่องยนต์%20รุ่น%20RZ4E-TC%20(Blue%20Power).pdf" ,tags: ["น้ำมันเครื่อง","RZ4E","บำรุงรักษา"] },
    { title: "TSE-SVB-2016-05 อัพเดทโปรแกรม G-IDSS [18032016].pdf", year: 2016, file: "TSE-SVB-2016-05%20อัพเดทโปรแกรม%20G-IDSS%20[18032016].pdf" ,tags: ["GIDSS","โปรแกรม","อัพเดท"] },
    { title: "TSE-SVB-2016-06 ปัญหาท่ออินเตอร์คูลเลอร์เสียดสีกับแผ่นกันความร้อน (เพิ่มเติม).pdf", year: 2016, file: "TSE-SVB-2016-06%20ปัญหาท่ออินเตอร์คูลเลอร์เสียดสีกับแผ่นกันความร้อน%20(เพิ่มเติม).pdf" ,tags: ["อินเตอร์คูลเลอร์","แผ่นกันความร้อน"] },
    { title: "TSE-SVB-2016-07 แนะนำการตรวจสอบปัญหาวิทยุและเพิ่มเติมรายการอะไหล่ (Clarion) แก้ไข.pdf", year: 2016, file: "TSE-SVB-2016-07%20แนะนำการตรวจสอบปัญหาวิทยุและเพิ่มเติมรายการอะไหล่%20(Clarion)%20แก้ไข.pdf" ,tags: ["อะไหล่","วิทยุ"] },
    { title: "TSE-SVB-2016-08 การตรวจสอบกระจกมองหลังพร้อมกล้องบันทึกภาพ mu-X Blue Power.pdf", year: 2016, file: "TSE-SVB-2016-08%20การตรวจสอบกระจกมองหลังพร้อมกล้องบันทึกภาพ%20mu-X%20Blue%20Power.pdf" ,tags: ["กล้อง","กระจกมองหลัง"] },
    { title: "TSE-SVB-2016-09 แนะนำข้อมูลจานลากหางพ่วง ยี่ห้อแม็กนั่มรุ่น MFW360 ชนิด A และการปรับตั้ง.pdf", year: 2016, file: "TSE-SVB-2016-09%20แนะนำข้อมูลจานลากหางพ่วง%20ยี่ห้อแม็กนั่มรุ่น%20MFW360%20ชนิด%20A%20และการปรับตั้ง.pdf" ,tags: ["จานลาก","Magnum"] },
    { title: "TSE-SVB-2016-10 แอพพลิเคชัน Isuzu Connect World และ i-Smart Navi Thailand.pdf", year: 2016, file: "TSE-SVB-2016-10%20แอพพลิเคชัน%20Isuzu%20Connect%20World%20และ%20i-Smart%20Navi%20Thailand.pdf" ,tags: ["แอพ","NAVI","วิทยุ"] },
    { title: "TSE-SVB-2016-11 อัพเดทโปรแกรม G-IDSS [18052016].pdf", year: 2016, file: "TSE-SVB-2016-11%20อัพเดทโปรแกรม%20G-IDSS%20[18052016].pdf" ,tags: ["GIDSS","โปรแกรม","อัพเดท"] },
    { title: "TSE-SVB-2016-12 ขั้นตอนการไล่ลมระบบน้ำมันพวงเพาเวอร์.pdf", year: 2016, file: "TSE-SVB-2016-12%20ขั้นตอนการไล่ลมระบบน้ำมันพวงเพาเวอร์.pdf" ,tags: ["น้ำมันพาวเวอร์","ลม","ระบบบังคับเลี้ยว"] },
    { title: "TSE-SVB-2016-13 อัพเดทข้อมูลแผนที่ระบบนำทาง เวอร์ชั่น 2016.10 สำหรับวิทยุ KENWOOD.pdf", year: 2016, file: "TSE-SVB-2016-13%20อัพเดทข้อมูลแผนที่ระบบนำทาง%20เวอร์ชั่น%202016.10%20สำหรับวิทยุ%20KENWOOD.pdf" ,tags: ["KENWOOD","วิทยุ","แผนที่"] },
    { title: "TSE-SVB-2016-14 การติดตั้งโปรแกรม G-IDSS เวอร์ชั่น 15.10.4.01.pdf", year: 2016, file: "TSE-SVB-2016-14%20การติดตั้งโปรแกรม%20G-IDSS%20เวอร์ชั่น%2015.10.4.01.pdf" ,tags: ["GIDSS","โปรแกรม","ติดตั้ง"] },
    { title: "TSE-SVB-2016-15 ปัญหาจากการติดตั้งวัสดุตกแต่งเสาอากาศวิทยุ.pdf", year: 2016, file: "TSE-SVB-2016-15%20ปัญหาจากการติดตั้งวัสดุตกแต่งเสาอากาศวิทยุ.pdf" ,tags: ["เสาอากาศ","วิทยุ"] },
    { title: "TSE-SVB-2016-16 ปัญหาจากการติดตั้งอุปกรณ์ประดับยนต์ที่ไม่เหมาะสม.pdf", year: 2016, file: "TSE-SVB-2016-16%20ปัญหาจากการติดตั้งอุปกรณ์ประดับยนต์ที่ไม่เหมาะสม.pdf" ,tags: ["ประดับยนต์"] },
    { title: "TSE-SVB-2016-17 แบบฟอร์มรายงานการตรวจสอบปัญหาชุดกระจกมองหลังพร้องบันทึกภาพหน้ารถ.pdf", year: 2016, file: "TSE-SVB-2016-17%20แบบฟอร์มรายงานการตรวจสอบปัญหาชุดกระจกมองหลังพร้องบันทึกภาพหน้ารถ.pdf" ,tags: ["กล้อง","กระจกมองหลัง","แบบฟอร์ม"] },
    { title: "TSE-SVB-2016-18 แนะนำการติดตั้งแหวนปะเก็นท่อแป๊บน้ำมันเพาเวอร์.pdf", year: 2016, file: "TSE-SVB-2016-18%20แนะนำการติดตั้งแหวนปะเก็นท่อแป๊บน้ำมันเพาเวอร์.pdf" ,tags: ["น้ำมันพาวเวอร์","ระบบบังคับเลี้ยว","ท่อแป๊บ"] },
    { title: "TSE-SVB-2016-19 โปรแกรมTIS2WEB และ Tech2Win.pdf", year: 2016, file: "TSE-SVB-2016-19%20โปรแกรมTIS2WEB%20และ%20Tech2Win.pdf" ,tags: ["TIS2WEB","Tech2Win","โปรแกรม"] },
    { title: "TSE-SVB-2016-20 อัพเดทโปรแกรม G-IDSS [05082016].pdf", year: 2016, file: "TSE-SVB-2016-20%20อัพเดทโปรแกรม%20G-IDSS%20[05082016].pdf" ,tags: ["GIDSS","โปรแกรม","อัพเดท"] },
    { title: "TSE-SVB-2016-21 ปัญหาเสียงดังบริเวณด้านหลังหัวเก๋ง.pdf", year: 2016, file: "TSE-SVB-2016-21%20ปัญหาเสียงดังบริเวณด้านหลังหัวเก๋ง.pdf" ,tags: ["เสียง"] },
    { title: "TSE-SVB-2016-22 การแก้ไขปัญหาน้ำรั่วเข้าห้องโดยสารบริเวณไฟเบรกดวงที่ 3.pdf", year: 2016, file: "TSE-SVB-2016-22%20การแก้ไขปัญหาน้ำรั่วเข้าห้องโดยสารบริเวณไฟเบรกดวงที่%203.pdf" ,tags: ["ไฟเบรก","ระบบไฟ","ระบบเบรก"] },
    { title: "TSE-SVB-2016-23 อัพเดทโปรแกรม G-IDSS [07102016].pdf", year: 2016, file: "TSE-SVB-2016-23%20อัพเดทโปรแกรม%20G-IDSS%20[07102016].pdf" ,tags: ["GIDSS","โปรแกรม","อัพเดท"] },
    { title: "TSE-SVB-2016-24 ไอน้ำภายในชุดโคมไฟหน้า.pdf", year: 2016, file: "TSE-SVB-2016-24%20ไอน้ำภายในชุดโคมไฟหน้า.pdf" ,tags: ["ระบบไฟ","ไฟหน้า","ไอน้ำ"] },
    { title: "TSE-SVB-2016-25 แอพพลิเคชัน i Smart Navi Thailand อัพเดท v.1.1.0.pdf", year: 2016, file: "TSE-SVB-2016-25%20แอพพลิเคชัน%20i%20Smart%20Navi%20Thailand%20อัพเดท%20v.1.1.0.pdf" ,tags: ["แอพ","NAVI","วิทยุ"] },
    { title: "TSE-SVB-2016-26 การตั้งค่าเส้นกะระยะกล้องมองหลัง Blue Power (DVD_DA_8นิ้ว).pdf", year: 2016, file: "TSE-SVB-2016-26%20การตั้งค่าเส้นกะระยะกล้องมองหลัง%20Blue%20Power%20(DVD_DA_8นิ้ว).pdf" ,tags: ["กล้อง","วิทยุ"] },
    { title: "TSE-SVB-2016-27 ข้อมูลค่าแรงขันชุดรอกปรับความตึงสายพาน สำหรับ RZ4E-TC.pdf", year: 2016, file: "TSE-SVB-2016-27%20ข้อมูลค่าแรงขันชุดรอกปรับความตึงสายพาน%20สำหรับ%20RZ4E-TC.pdf" ,tags: ["RZ4E","สายพาน","แรงขัน"] },
    { title: "TSE-SVB-2016-28 ข้อควรระวังขณะบริการเปลี่ยนปั๊มน้ำ เครื่่องยนต์ 6UZ1.pdf", year: 2016, file: "TSE-SVB-2016-28%20ข้อควรระวังขณะบริการเปลี่ยนปั๊มน้ำ%20เครื่่องยนต์%206UZ1.pdf" ,tags: ["6UZ1","ปั้มน้ำ","ระบบเครื่องยนต์"] },
    { title: "TSE-SVB-2016-29 ข้อควรระวังในการรีเซ็ตโปรแกรม G-IDSS.pdf", year: 2016, file: "TSE-SVB-2016-29%20ข้อควรระวังในการรีเซ็ตโปรแกรม%20G-IDSS.pdf" ,tags: ["GIDSS","โปรแกรม","รีเซ็ต"] },
    { title: "TSE-SVB-2017-01 การอัพเดทเฟิร์มแวร์ WiFi Dongle (KENWOOD KCA-WL100).pdf", year: 2017, file: "TSE-SVB-2017-01%20การอัพเดทเฟิร์มแวร์%20WiFi%20Dongle%20(KENWOOD%20KCA-WL100).pdf" ,tags: ["KENWOOD","Wifi","Dongle"] },
    { title: "TSE-SVB-2017-02 ข้อแนะนำการตั้งค่าสำหรับวิทยุ KENWOOD DNX7150BT.pdf", year: 2017, file: "TSE-SVB-2017-02%20ข้อแนะนำการตั้งค่าสำหรับวิทยุ%20KENWOOD%20DNX7150BT.pdf" ,tags: ["KENWOOD","วิทยุ"] },
    { title: "TSE-SVB-2017-03 แนะนำวิธีการรีเซ็ตการเรียนรู้ปริมาณการฉีดน้ำมันเชื้อเพลิง.pdf", year: 2017, file: "TSE-SVB-2017-03%20แนะนำวิธีการรีเซ็ตการเรียนรู้ปริมาณการฉีดน้ำมันเชื้อเพลิง.pdf" ,tags: ["รีเซ็ต","ระบบน้ำมันเชื้อเพลิง","หัวฉีด"] },
    { title: "TSE-SVB-2017-04 การป้องกันการเกิดความชื้นในเครื่องยนต์ (ฉบับแก้ไข).pdf", year: 2017, file: "TSE-SVB-2017-04%20การป้องกันการเกิดความชื้นในเครื่องยนต์%20(ฉบับแก้ไข).pdf" ,tags: ["ระบบเครื่องยนต์","ความชื้น"] },
    { title: "TSE-SVB-2017-05 การเตือนความจุใน SD การ์ดกล้องบันทึกภาพ DVR.pdf", year: 2017, file: "TSE-SVB-2017-05%20การเตือนความจุใน%20SD%20การ์ดกล้องบันทึกภาพ%20DVR.pdf" ,tags: ["SD","กล้อง","DVR"] },
    { title: "TSE-SVB-2017-06 อัพเดทโปรแกรม G-IDSS [02032017].pdf", year: 2017, file: "TSE-SVB-2017-06%20อัพเดทโปรแกรม%20G-IDSS%20[02032017].pdf" ,tags: ["GIDSS","โปรแกรม","อัพเดท"] },
    { title: "TSE-SVB-2017-07 แนะนำการถอดและติดตั้งชุดไฟท้าย mu-X.pdf", year: 2017, file: "TSE-SVB-2017-07%20แนะนำการถอดและติดตั้งชุดไฟท้าย%20mu-X.pdf" ,tags: ["ระบบไฟ","ไฟท้าย"] },
    { title: "TSE-SVB-2017-08 อัพเดทข้อมูลแผนที่ระบบนำทาง เวอร์ชั่น 2016.06 สำหรับวิทยุ CLARION.pdf", year: 2017, file: "TSE-SVB-2017-08%20อัพเดทข้อมูลแผนที่ระบบนำทาง%20เวอร์ชั่น%202016.06%20สำหรับวิทยุ%20CLARION.pdf" ,tags: ["วิทยุ","CLARION","แผนที่"] },
    { title: "TSE-SVB-2017-09 อัพเดทโปรแกรม G-IDSS [28042017].pdf", year: 2017, file: "TSE-SVB-2017-09%20อัพเดทโปรแกรม%20G-IDSS%20[28042017].pdf" ,tags: ["GIDSS","โปรแกรม","อัพเดท"] },
    { title: "TSE-SVB-2017-10 ข้อแนะนำการตรวจสอบปัญหาไฟแสดงตำแหน่งเกียร์ (GSI).pdf", year: 2017, file: "TSE-SVB-2017-10%20ข้อแนะนำการตรวจสอบปัญหาไฟแสดงตำแหน่งเกียร์%20(GSI).pdf" ,tags: ["ระบบเกียร์","GSI"] },
    { title: "TSE-SVB-2017-11 อัพเดท POI แอพพลิเคชัน i Smart Navi Thailand.pdf", year: 2017, file: "TSE-SVB-2017-11%20อัพเดท%20POI%20แอพพลิเคชัน%20i%20Smart%20Navi%20Thailand.pdf" ,tags: ["POI","NAVI","แผนที่"] },
    { title: "TSE-SVB-2017-12 ข้อแนะนำการตรวจสอบค่าแรงดันลมยางก่อนส่งมอบลูกค้า.pdf", year: 2017, file: "TSE-SVB-2017-12%20ข้อแนะนำการตรวจสอบค่าแรงดันลมยางก่อนส่งมอบลูกค้า.pdf" ,tags: ["ล้อและยาง","ลมยาง"] },
    { title: "TSE-SVB-2017-13 ข้อมูลรับประกันและการบำรุงรักษารถบรรทุกอีซูซุใหม่ ปี 2016.pdf", year: 2017, file: "TSE-SVB-2017-13%20ข้อมูลรับประกันและการบำรุงรักษารถบรรทุกอีซูซุใหม่%20ปี%202016.pdf" ,tags: ["รับประกัน","บำรุงรักษา"] },
    { title: "TSE-SVB-2017-14 การตรวจสอบท่อลมเบรกที่คานขวาง ก่อนส่งมอบรถ.pdf", year: 2017, file: "TSE-SVB-2017-14%20การตรวจสอบท่อลมเบรกที่คานขวาง%20ก่อนส่งมอบรถ.pdf" ,tags: ["ระบบเบรก","ท่อลม","CV"] },
    { title: "TSE-SVB-2017-15 อัพเดทข้อมูลแผนที่ระบบนำทาง เวอร์ชั่น 2017 สำหรับวิทยุ KENWOOD.pdf", year: 2017, file: "TSE-SVB-2017-15%20อัพเดทข้อมูลแผนที่ระบบนำทาง%20เวอร์ชั่น%202017%20สำหรับวิทยุ%20KENWOOD.pdf" ,tags: ["KENWOOD","วิทยุ","แผนที่"] },
    { title: "TSE-SVB-2017-16 แนะนำการแก้ไขปัญหาสัญญาณ GPS ผิดปกติ.pdf", year: 2017, file: "TSE-SVB-2017-16%20แนะนำการแก้ไขปัญหาสัญญาณ%20GPS%20ผิดปกติ.pdf" ,tags: ["GPS"] },
    { title: "TSE-SVB-2017-17 อัพเดทโปรแกรม G-IDSS [12062017].pdf", year: 2017, file: "TSE-SVB-2017-17%20อัพเดทโปรแกรม%20G-IDSS%20[12062017].pdf" ,tags: ["GIDSS","โปรแกรม","อัพเดท"] },
    { title: "TSE-SVB-2017-18 อะไหล่ก้ามล็อกจานลากหางพ่วง Magnum (MFW-360).pdf", year: 2017, file: "TSE-SVB-2017-18%20อะไหล่ก้ามล็อกจานลากหางพ่วง%20Magnum%20(MFW-360).pdf" ,tags: ["จานลาก","อะไหล่","Magnum"] },
    { title: "TSE-SVB-2017-19 แจ้งเปลี่ยนแปลงรายการการบำรุงรักษารถของรถบรรทุกอีซูซุรุ่นใหม่.pdf", year: 2017, file: "TSE-SVB-2017-19%20แจ้งเปลี่ยนแปลงรายการการบำรุงรักษารถของรถบรรทุกอีซูซุรุ่นใหม่.pdf" ,tags: ["บำรุงรักษา"] },
    { title: "TSE-SVB-2017-20 แจ้งข้อมูลรายการหมายเลขอะไหล่สำหรับเครื่องยนต์ RZ4E.pdf", year: 2017, file: "TSE-SVB-2017-20%20แจ้งข้อมูลรายการหมายเลขอะไหล่สำหรับเครื่องยนต์%20RZ4E.pdf" ,tags: ["อะไหล่","RZ4E"] },
    { title: "TSE-SVB-2017-21 ข้อแนะนำการทำความสะอาดไส้กรองน้ำมันเฟืองท้ายเพลาหลังด้านหน้า.pdf", year: 2017, file: "TSE-SVB-2017-21%20ข้อแนะนำการทำความสะอาดไส้กรองน้ำมันเฟืองท้ายเพลาหลังด้านหน้า.pdf" ,tags: ["ไส้กรอง","น้ำมันเกียร์","ระบบเกียร์"] },
    { title: "TSE-SVB-2017-22 แนะนำการถอด-ประกอบ ชิ้นส่วน จานลากหางพ่วง ยี่ห้อแม็กนั่มรุ่น MFW360 ชนิด A .pdf", year: 2017, file: "TSE-SVB-2017-22%20แนะนำการถอด-ประกอบ%20ชิ้นส่วน%20จานลากหางพ่วง%20ยี่ห้อแม็กนั่มรุ่น%20MFW360%20ชนิด%20A%20.pdf" ,tags: ["จานลาก","Magnum"] },
    { title: "TSE-SVB-2017-23 การแสดงค่าระยะทางที่สามารถขับได้ (RANGE) บนหน้าปัด.pdf", year: 2017, file: "TSE-SVB-2017-23%20การแสดงค่าระยะทางที่สามารถขับได้%20(RANGE)%20บนหน้าปัด.pdf" ,tags: ["หน้าปัด"] },
    { title: "TSE-SVB-2017-24 ข้อแนะนำการดูแลรักษาแบตเตอรี่.pdf", year: 2017, file: "TSE-SVB-2017-24%20ข้อแนะนำการดูแลรักษาแบตเตอรี่.pdf" ,tags: ["แบตเตอรี่","บำรุงรักษา"] },
    { title: "TSE-SVB-2017-25 แจ้งเพิ่มเติมรายการอะไหล่กระจกมองข้าง .pdf", year: 2017, file: "TSE-SVB-2017-25%20แจ้งเพิ่มเติมรายการอะไหล่กระจกมองข้าง%20.pdf" ,tags: ["อะไหล่","กระจกมองข้าง"] },
    { title: "TSE-SVB-2017-26 คู่มือมาตรฐานการคิดค่าแรงสำหรับการเคลม (FX, FY&GX 1710).pdf", year: 2017, file: "TSE-SVB-2017-26%20คู่มือมาตรฐานการคิดค่าแรงสำหรับการเคลม%20(FX,%20FY&GX%201710).pdf" ,tags: ["LTG","FXGX","ค่าแรง"] },
    { title: "TSE-SVB-2017-27 ข้อมูลเกี่ยวกับการลดลงของระดับน้ำมันเครื่อง.pdf", year: 2017, file: "TSE-SVB-2017-27%20ข้อมูลเกี่ยวกับการลดลงของระดับน้ำมันเครื่อง.pdf" ,tags: ["น้ำมันเครื่อง"] },
    { title: "TSE-SVB-2017-28 อัพเดทโปรแกรม G-IDSS [11112017].pdf", year: 2017, file: "TSE-SVB-2017-28%20อัพเดทโปรแกรม%20G-IDSS%20[11112017].pdf" ,tags: ["GIDSS","โปรแกรม","อัพเดท"] },
    { title: "TSE-SVB-2017-29 อัพเดทข้อมูลแผนที่แอพพลิเคชันระบบนำทาง i Smart Navi Thailand.pdf", year: 2017, file: "TSE-SVB-2017-29%20อัพเดทข้อมูลแผนที่แอพพลิเคชันระบบนำทาง%20i%20Smart%20Navi%20Thailand.pdf" ,tags: ["แผนที่","NAVI","อัพเดท"] },
    { title: "TSE-SVB-2017-30 การอัพเดทเฟิร์มแวร์ WiFi Dongle KENWOOD สำหรับ iOS 11.pdf", year: 2017, file: "TSE-SVB-2017-30%20การอัพเดทเฟิร์มแวร์%20WiFi%20Dongle%20KENWOOD%20สำหรับ%20iOS%2011.pdf" ,tags: ["KENWOOD","Wifi","Dongle"] },
    { title: "TSE-SVB-2018-01 แนะนำการตรวจสอบปัญหาเสียงลม.pdf", year: 2018, file: "TSE-SVB-2018-01%20แนะนำการตรวจสอบปัญหาเสียงลม.pdf" ,tags: ["เสียง","ลม"] },
    { title: "TSE-SVB-2018-02 การใช้ชนิดน้ำมันเครื่องสำหรับรถบรรทุก.pdf", year: 2018, file: "TSE-SVB-2018-02%20การใช้ชนิดน้ำมันเครื่องสำหรับรถบรรทุก.pdf" ,tags: ["น้ำมันเครื่อง","CV"] },
    { title: "TSE-SVB-2018-03 รายการหมายเลขอะไหล่สำหรับเครื่องยนต์ RZ4E (เพิ่มเติม).pdf", year: 2018, file: "TSE-SVB-2018-03%20รายการหมายเลขอะไหล่สำหรับเครื่องยนต์%20RZ4E%20(เพิ่มเติม).pdf" ,tags: ["RZ4E","อะไหล่"] },
    { title: "TSE-SVB-2018-04 โปรแกรม G-IDSS เวอร์ชั่น 17.08.4.1.pdf", year: 2018, file: "TSE-SVB-2018-04%20โปรแกรม%20G-IDSS%20เวอร์ชั่น%2017.08.4.1.pdf" ,tags: ["GIDSS"] },
    { title: "TSE-SVB-2018-05 การใช้งานตำแหน่ง P เกียร์อัตโนมัติ.pdf", year: 2018, file: "TSE-SVB-2018-05%20การใช้งานตำแหน่ง%20P%20เกียร์อัตโนมัติ.pdf" ,tags: ["ระบบเกียร์"] },
    { title: "TSE-SVB-2018-06 ข้อกำหนดตำแหน่งการทาจาระบีเพิ่มเติมในขั้นตอนการประกอบชุดดิสก์เบรกหน้า .pdf", year: 2018, file: "TSE-SVB-2018-06%20ข้อกำหนดตำแหน่งการทาจาระบีเพิ่มเติมในขั้นตอนการประกอบชุดดิสก์เบรกหน้า%20.pdf" ,tags: ["ระบบเบรก","จาระบี"] },
    { title: "TSE-SVB-2018-07 แจ้งข้อมูลเกี่ยวกับเสียงดังจากการทำงานของ EHCU.pdf", year: 2018, file: "TSE-SVB-2018-07%20แจ้งข้อมูลเกี่ยวกับเสียงดังจากการทำงานของ%20EHCU.pdf" ,tags: ["EHCU","เสียง"] },
    { title: "TSE-SVB-2018-08 ข้อกำหนดการใช้ชนิดน้ำมันหล่อลื่น และของเหลว(TF_UC).pdf", year: 2018, file: "TSE-SVB-2018-08%20ข้อกำหนดการใช้ชนิดน้ำมันหล่อลื่น%20และของเหลว(TF_UC).pdf" ,tags: ["น้ำมันเครื่อง","บำรุงรักษา"] },
    { title: "TSE-SVB-2018-09 คู่มือมาตรฐานการคิดค่าแรง D-MAX&mu (1802)[L1G].pdf", year: 2018, file: "TSE-SVB-2018-09%20คู่มือมาตรฐานการคิดค่าแรง%20D-MAX&mu%20(1802)[L1G].pdf" ,tags: ["LCV","ค่าแรง","LTG"] },
    { title: "TSE-SVB-2018-10 ข้อควรระวังขณะปฏิบัติงานใกล้ท่อน้ำยาระบบปรับอากาศ.pdf", year: 2018, file: "TSE-SVB-2018-10%20ข้อควรระวังขณะปฏิบัติงานใกล้ท่อน้ำยาระบบปรับอากาศ.pdf" ,tags: ["ระบบปรับอากาศ","ท่อน้ำยา"] },
    { title: "TSE-SVB-2018-11 ข้อกำหนดการใช้ชนิดน้ำมันและของเหลวสำหรับรถบรรทุก.pdf", year: 2018, file: "TSE-SVB-2018-11%20ข้อกำหนดการใช้ชนิดน้ำมันและของเหลวสำหรับรถบรรทุก.pdf" ,tags: ["น้ำมันเครื่อง","CV"] },
    { title: "TSE-SVB-2018-12 คู่มือมาตรฐานการคิดค่าแรง รถบรรทุกอีซูซุ F&G[M1G].pdf", year: 2018, file: "TSE-SVB-2018-12%20คู่มือมาตรฐานการคิดค่าแรง%20รถบรรทุกอีซูซุ%20F&G[M1G].pdf" ,tags: ["F&G","ค่าแรง","LTG"] },
    { title: "TSE-SVB-2018-13 อัพเดทข้อมูลแผนที่ระบบนำทาง เวอร์ชั่น 2017.06 สำหรับวิทยุ CLARION.pdf", year: 2018, file: "TSE-SVB-2018-13%20อัพเดทข้อมูลแผนที่ระบบนำทาง%20เวอร์ชั่น%202017.06%20สำหรับวิทยุ%20CLARION.pdf" ,tags: ["วิทยุ","CLARION","แผนที่"] },
    { title: "TSE-SVB-2018-14 คู่มือมาตรฐานการคิดค่าแรงสำหรับรถบรรทุก FX, FY&GX (1804)H3G.pdf", year: 2018, file: "TSE-SVB-2018-14%20คู่มือมาตรฐานการคิดค่าแรงสำหรับรถบรรทุก%20FX,%20FY&GX%20(1804)H3G.pdf" ,tags: ["FXGX","ค่าแรง","LTG"] },
    { title: "TSE-SVB-2018-15  ข้อแนะนำการถอดและติดตั้งปลั๊กต่อมัดสายไฟเครื่องยนต์ .pdf", year: 2018, file: "TSE-SVB-2018-15%20%20ข้อแนะนำการถอดและติดตั้งปลั๊กต่อมัดสายไฟเครื่องยนต์%20.pdf" ,tags: ["ระบบเครื่องยนต์","ระบบไฟ"] },
    { title: "TSE-SVB-2018-16 คู่มือมาตรฐานการคิดค่าแรงสำหรับรถบรรทุก F&G (SM-F&G-1804)H1G.pdf", year: 2018, file: "TSE-SVB-2018-16%20คู่มือมาตรฐานการคิดค่าแรงสำหรับรถบรรทุก%20F&G%20(SM-F&G-1804)H1G.pdf" ,tags: ["F&G","ค่าแรง","LTG"] },
    { title: "TSE-SVB-2018-17 อัพเดทโปรแกรม G-IDSS [06042018].pdf", year: 2018, file: "TSE-SVB-2018-17%20อัพเดทโปรแกรม%20G-IDSS%20[06042018].pdf" ,tags: ["GIDSS","โปรแกรม","อัพเดท"] },
    { title: "TSE-SVB-2018-18 คู่มือมาตรฐานการคิดค่าแรง D-MAX&MU (SM-TFUC-1804)L1G.pdf", year: 2018, file: "TSE-SVB-2018-18%20คู่มือมาตรฐานการคิดค่าแรง%20D-MAX&MU%20(SM-TFUC-1804)L1G.pdf" ,tags: ["LCV","ค่าแรง","LTG"] },
    { title: "TSE-SVB-2018-19 การตรวจสอบเลือกเกรดแบริ่งเพลาข้อเหวี่ยง RZ4E.pdf", year: 2018, file: "TSE-SVB-2018-19%20การตรวจสอบเลือกเกรดแบริ่งเพลาข้อเหวี่ยง%20RZ4E.pdf" ,tags: ["RZ4E","ระบบเครื่องยนต์","แบริ่ง"] },
    { title: "TSE-SVB-2018-20 อัพเดทข้อมูลแผนที่ระบบนำทาง เวอร์ชั่น 2018 สำหรับวิทยุ KENWOOD.pdf", year: 2018, file: "TSE-SVB-2018-20%20อัพเดทข้อมูลแผนที่ระบบนำทาง%20เวอร์ชั่น%202018%20สำหรับวิทยุ%20KENWOOD.pdf" ,tags: ["วิทยุ","KENWOOD","แผนที่"] },
    { title: "TSE-SVB-2018-21 อัพเดทโปรแกรม G-IDSS [08062018].pdf", year: 2018, file: "TSE-SVB-2018-21%20อัพเดทโปรแกรม%20G-IDSS%20[08062018].pdf" ,tags: ["GIDSS","โปรแกรม","อัพเดท"] },
    { title: "TSE-SVB-2018-22 ข้อมูลเกี่ยวกับการเข้ารับบริการตามระยะการบำรุงรักษา.pdf", year: 2018, file: "TSE-SVB-2018-22%20ข้อมูลเกี่ยวกับการเข้ารับบริการตามระยะการบำรุงรักษา.pdf" ,tags: ["บำรุงรักษา"] },
    { title: "TSE-SVB-2018-23 ข้อมูลระยะการบำรุงรักษารถบรรทุกอีซูซุ N รุ่นปี 2017.pdf", year: 2018, file: "TSE-SVB-2018-23%20ข้อมูลระยะการบำรุงรักษารถบรรทุกอีซูซุ%20N%20รุ่นปี%202017.pdf" ,tags: ["บำรุงรักษา","N"] },
    { title: "TSE-SVB-2018-24 ข้อควรระวังขณะติดตั้งซีลเพลาข้อเหวี่ยงหลัง RZ4E ฉบับแก้ไข.pdf", year: 2018, file: "TSE-SVB-2018-24%20ข้อควรระวังขณะติดตั้งซีลเพลาข้อเหวี่ยงหลัง%20RZ4E%20ฉบับแก้ไข.pdf" ,tags: ["ระบบเครื่องยนต์","RZ4E","ซีล"] },
    { title: "TSE-SVB-2018-25 คู่มือมาตรฐานการคิดค่าแรงรถบรรทุก N (SM-N-1806)[L4G].pdf", year: 2018, file: "TSE-SVB-2018-25%20คู่มือมาตรฐานการคิดค่าแรงรถบรรทุก%20N%20(SM-N-1806)[L4G].pdf" ,tags: ["N","ค่าแรง","LTG"] },
    { title: "TSE-SVB-2018-26 การขยายระยะเวลารับประกันรถบรรทุกอีซูซุ ขนาด 2 ตันขึ้นไป.pdf", year: 2018, file: "TSE-SVB-2018-26%20การขยายระยะเวลารับประกันรถบรรทุกอีซูซุ%20ขนาด%202%20ตันขึ้นไป.pdf" ,tags: ["รับประกัน","CV"] },
    { title: "TSE-SVB-2018-27 อัพเดทคู่มือมาตรฐานการคิดค่าแรง D-MAX&MU _(SM-TFUC-1806_).pdf", year: 2018, file: "TSE-SVB-2018-27%20อัพเดทคู่มือมาตรฐานการคิดค่าแรง%20D-MAX&MU%20_(SM-TFUC-1806_).pdf" ,tags: ["LCV","ค่าแรง","LTG"] },
    { title: "TSE-SVB-2018-28 แนะนำฟังก์ชั่นในโปรแกรม G-IDSS.pdf", year: 2018, file: "TSE-SVB-2018-28%20แนะนำฟังก์ชั่นในโปรแกรม%20G-IDSS.pdf" ,tags: ["GIDSS","โปรแกรม","อัพเดท"] },
    { title: "TSE-SVB-2018-29 ข้อมูลระยะการบำรุงรักษารถบรรทุกอีซูซุ FRR รุ่นปี 2017.pdf", year: 2018, file: "TSE-SVB-2018-29%20ข้อมูลระยะการบำรุงรักษารถบรรทุกอีซูซุ%20FRR%20รุ่นปี%202017.pdf" ,tags: ["FRR","บำรุงรักษา"] },
    { title: "TSE-SVB-2018-30 อัพเดทโปรแกรม G-IDSS [17092018].pdf", year: 2018, file: "TSE-SVB-2018-30%20อัพเดทโปรแกรม%20G-IDSS%20[17092018].pdf" ,tags: ["GIDSS","โปรแกรม","อัพเดท"] },
    { title: "TSE-SVB-2018-31 ข้อแนะนำการเปลี่ยนไส้กรองน้ำมันเครื่อง RZ4E.pdf", year: 2018, file: "TSE-SVB-2018-31%20ข้อแนะนำการเปลี่ยนไส้กรองน้ำมันเครื่อง%20RZ4E.pdf" ,tags: ["ไส้กรอง","น้ำมันเครื่อง","RZ4E"] },
    { title: "TSE-SVB-2018-32 อัพเดทซอฟต์แวร์เพื่อรับข้อมูการจราจร วิทยุ KENWOOD.pdf", year: 2018, file: "TSE-SVB-2018-32%20อัพเดทซอฟต์แวร์เพื่อรับข้อมูการจราจร%20วิทยุ%20KENWOOD.pdf" ,tags: ["วิทยุ","KENWOOD","อัพเดท"] },
    { title: "TSE-SVB-2018-33 อัพเดทโปรแกรม G-IDSS [26102018].pdf", year: 2018, file: "TSE-SVB-2018-33%20อัพเดทโปรแกรม%20G-IDSS%20[26102018].pdf" ,tags: ["GIDSS","โปรแกรม","อัพเดท"] },
    { title: "TSE-SVB-2018-34 คู่มือมาตรฐานการคิดค่าแรงรถบรรทุก FX, FY&GX (SM-FX-1810)H3G.pdf", year: 2018, file: "TSE-SVB-2018-34%20คู่มือมาตรฐานการคิดค่าแรงรถบรรทุก%20FX,%20FY&GX%20(SM-FX-1810)H3G.pdf" ,tags: ["FXGX","ค่าแรง","LTG"] },
    { title: "TSE-SVB-2018-35 ข้อแนะนำเกี่ยวกับการบำรุงรักษาน้ำมันเกียร์อัตโนมัติ.pdf", year: 2018, file: "TSE-SVB-2018-35%20ข้อแนะนำเกี่ยวกับการบำรุงรักษาน้ำมันเกียร์อัตโนมัติ.pdf" ,tags: ["บำรุงรักษา","ระบบเกียร์","น้ำมันเกียร์"] },
    { title: "TSE-SVB-2018-36 อัพเดทโปรแกรม G-IDSS [10112018].pdf", year: 2018, file: "TSE-SVB-2018-36%20อัพเดทโปรแกรม%20G-IDSS%20[10112018].pdf" ,tags: ["GIDSS","โปรแกรม","อัพเดท"] },
    { title: "TSE-SVB-2018-37 คู่มือมาตรฐานการคิดค่าแรงสำหรับรถบรรทุก F&G (SM-F&G-1812).pdf", year: 2018, file: "TSE-SVB-2018-37%20คู่มือมาตรฐานการคิดค่าแรงสำหรับรถบรรทุก%20F&G%20(SM-F&G-1812).pdf" ,tags: ["F&G","ค่าแรง","LTG"] },
    { title: "TSE-SVB-2018-38 คู่มือมาตรฐานการคิดค่าแรงสำหรับรถบรรทุก FXGX (SM-FXGX-1812).pdf", year: 2018, file: "TSE-SVB-2018-38%20คู่มือมาตรฐานการคิดค่าแรงสำหรับรถบรรทุก%20FXGX%20(SM-FXGX-1812).pdf" ,tags: ["FXGX","ค่าแรง","LTG"] },
    { title: "TSE-SVB-2019-01  ข้อแนะนำการแก้ไขปัญหาเบาะมีเสียงดัง.pdf", year: 2019, file: "TSE-SVB-2019-01%20%20ข้อแนะนำการแก้ไขปัญหาเบาะมีเสียงดัง.pdf" ,tags: ["เบาะนั่ง","เสียง"] },
    { title: "TSE-SVB-2019-02  ข้อแนะนำการแก้ไขปัญหาเบรกสั่น.pdf", year: 2019, file: "TSE-SVB-2019-02%20%20ข้อแนะนำการแก้ไขปัญหาเบรกสั่น.pdf" ,tags: ["ระบบเบรก","สั่น"] },
    { title: "TSE-SVB-2019-03 ข้อแนะนำการตรวจเช็กและบำรุงรักษาชิ้น~นเชื้อเพลิง สำหรับรถที่ใช้น้ำมันไบโอดีเซล B20.pdf", year: 2019, file: "TSE-SVB-2019-03%20ข้อแนะนำการตรวจเช็กและบำรุงรักษาชิ้น~นเชื้อเพลิง%20สำหรับรถที่ใช้น้ำมันไบโอดีเซล%20B20.pdf" ,tags: ["B20","ระบบน้ำมันเชื้อเพลิง","บำรุงรักษา"] },
    { title: "TSE-SVB-2019-04 การแก้ไขรหัสปัญหา P042E P042F เครื่องยนต์ RZ4E.pdf", year: 2019, file: "TSE-SVB-2019-04%20การแก้ไขรหัสปัญหา%20P042E%20P042F%20เครื่องยนต์%20RZ4E.pdf" ,tags: ["ระบบเครื่องยนต์","P042E","P042F"] },
    { title: "TSE-SVB-2019-05 อัพเดทโปรแกรม G-IDSS [08022019].pdf", year: 2019, file: "TSE-SVB-2019-05%20อัพเดทโปรแกรม%20G-IDSS%20[08022019].pdf" ,tags: ["GIDSS"] },
    { title: "TSE-SVB-2019-06 ข้อควรปฏิบัติในการอัดจาระบี.pdf", year: 2019, file: "TSE-SVB-2019-06%20ข้อควรปฏิบัติในการอัดจาระบี.pdf" ,tags: ["จาระบี"] },
    { title: "TSE-SVB-2019-07 การติดตั้งโปรแกรม G-IDSS เวอร์ชั่น 18.08.4.1.pdf", year: 2019, file: "TSE-SVB-2019-07%20การติดตั้งโปรแกรม%20G-IDSS%20เวอร์ชั่น%2018.08.4.1.pdf" ,tags: ["GIDSS"] },
    { title: "TSE-SVB-2019-08 การรีโปรแกรมหน้าปัดสำหรับรถบรรทุก Isuzu King of Trucks (Revised).pdf", year: 2019, file: "TSE-SVB-2019-08%20การรีโปรแกรมหน้าปัดสำหรับรถบรรทุก%20Isuzu%20King%20of%20Trucks%20(Revised).pdf" ,tags: ["หน้าปัด","โปรแกรม"] },
    { title: "TSE-SVB-2019-09 อัพเดทข้อมูลแผนที่ระบบนำทาง เวอร์ชั่น 2019 สำหรับวิทยุ KENWOOD.pdf", year: 2019, file: "TSE-SVB-2019-09%20อัพเดทข้อมูลแผนที่ระบบนำทาง%20เวอร์ชั่น%202019%20สำหรับวิทยุ%20KENWOOD.pdf" ,tags: ["วิทยุ","KENWOOD","แผนที่"] },
    { title: "TSE-SVB-2019-10 อัพเดทข้อมูลแผนที่ระบบนำทาง เวอร์ชั่น 2018.06 สำหรับวิทยุ CLARION .pdf", year: 2019, file: "TSE-SVB-2019-10%20อัพเดทข้อมูลแผนที่ระบบนำทาง%20เวอร์ชั่น%202018.06%20สำหรับวิทยุ%20CLARION%20.pdf" ,tags: ["วิทยุ","CLARION","แผนที่"] },
    { title: "TSE-SVB-2019-11 การตรวจเช็กและการบำรุงรักษาชิ้นส่วนร~ง สำหรับรถที่ใช้น้ำมันไบโอดีเซล B20 (เพิ่มเติม).pdf", year: 2019, file: "TSE-SVB-2019-11%20การตรวจเช็กและการบำรุงรักษาชิ้นส่วนร~ง%20สำหรับรถที่ใช้น้ำมันไบโอดีเซล%20B20%20(เพิ่มเติม).pdf" ,tags: ["บำรุงรักษา","ระบบน้ำมันเชื้อเพลิง","B20"] },
    { title: "TSE-SVB-2019-12 ข้อควรระวังในการถอดประกอบและติดตั้งชิ้นส่วนที่เกี่ยวกับระบบถุงลม.pdf", year: 2019, file: "TSE-SVB-2019-12%20ข้อควรระวังในการถอดประกอบและติดตั้งชิ้นส่วนที่เกี่ยวกับระบบถุงลม.pdf" ,tags: ["ระบบถุงลม"] },
    { title: "TSE-SVB-2019-13 ข้อแนะนำการตรวจสอบและแจ้งปัญหาเกียร์ ZF มีเสียงดัง.pdf", year: 2019, file: "TSE-SVB-2019-13%20ข้อแนะนำการตรวจสอบและแจ้งปัญหาเกียร์%20ZF%20มีเสียงดัง.pdf" ,tags: ["ZF","เสียง","ระบบเกียร์"] },
    { title: "TSE-SVB-2019-14 ข้อแนะนำเมื่อทำการล้างห้องเครื่องยนต์.pdf", year: 2019, file: "TSE-SVB-2019-14%20ข้อแนะนำเมื่อทำการล้างห้องเครื่องยนต์.pdf" ,tags: ["ระบบเครื่องยนต์","ล้าง"] },
    { title: "TSE-SVB-2019-15 การแก้ไขปัญหาฝาปิดช่องเติมน้ำมันเชื้อเพลิงติดขัด.pdf", year: 2019, file: "TSE-SVB-2019-15%20การแก้ไขปัญหาฝาปิดช่องเติมน้ำมันเชื้อเพลิงติดขัด.pdf" ,tags: ["ระบบน้ำมันเชื้อเพลิง","ฝาปิด"] },
    { title: "TSE-SVB-2019-16 การเปลี่ยนชิ้นส่วนก่อนการใช้น้ำมันไบโอดีเซล B20 สำหรับ D-MAX&MU-X.pdf", year: 2019, file: "TSE-SVB-2019-16%20การเปลี่ยนชิ้นส่วนก่อนการใช้น้ำมันไบโอดีเซล%20B20%20สำหรับ%20D-MAX&MU-X.pdf" ,tags: ["ระบบน้ำมันเชื้อเพลิง","B20","LCV"] },
    { title: "TSE-SVB-2019-17 แจ้งข้อแนะนำเพิ่มเติมเกี่ยวกับข้อกำหนดการสลับยาง .pdf", year: 2019, file: "TSE-SVB-2019-17%20แจ้งข้อแนะนำเพิ่มเติมเกี่ยวกับข้อกำหนดการสลับยาง%20.pdf" ,tags: ["สลับยาง","ล้อและยาง"] },
    { title: "TSE-SVB-2019-18 แจ้งข้อมูลเกี่ยวกับการสนับสนุนโปรแกรม G-IDSS.pdf", year: 2019, file: "TSE-SVB-2019-18%20แจ้งข้อมูลเกี่ยวกับการสนับสนุนโปรแกรม%20G-IDSS.pdf" ,tags: ["GIDSS","โปรแกรม"] },
    { title: "TSE-SVB-2019-19 ข้อแนะนำเกี่ยวกับค่าแรง ตรวจเช็กสภาพทั่วไปของรถ.pdf", year: 2019, file: "TSE-SVB-2019-19%20ข้อแนะนำเกี่ยวกับค่าแรง%20ตรวจเช็กสภาพทั่วไปของรถ.pdf" ,tags: ["ค่าแรง","LTG"] },
    { title: "TSE-SVB-2019-20 ข้อแนะนำและการแก้ไขปัญหาเข้าเกียร์ยาก สำหรับเกียร์ รุ่น MEB 9.pdf", year: 2019, file: "TSE-SVB-2019-20%20ข้อแนะนำและการแก้ไขปัญหาเข้าเกียร์ยาก%20สำหรับเกียร์%20รุ่น%20MEB%209.pdf" ,tags: ["ระบบเกียร์","MEB"] },
    { title: "TSE-SVB-2019-21 การอัพเดทข้อมูลแผนที่ระบบนำทาง สำหรับวิทยุ PANASONIC (DVD NAVI) .pdf", year: 2019, file: "TSE-SVB-2019-21%20การอัพเดทข้อมูลแผนที่ระบบนำทาง%20สำหรับวิทยุ%20PANASONIC%20(DVD%20NAVI)%20.pdf" ,tags: ["วิทยุ","แผนที่","PANASONIC"] },
    { title: "TSE-SVB-2019-22 ข้อแนะนำวิธีการส่งวิทยุ Isuzu Media Solutions (Clarion) เพื่อตรวจสอบและซ่อม.pdf", year: 2019, file: "TSE-SVB-2019-22%20ข้อแนะนำวิธีการส่งวิทยุ%20Isuzu%20Media%20Solutions%20(Clarion)%20เพื่อตรวจสอบและซ่อม.pdf" ,tags: ["วิทยุ","CLARION"] },
    { title: "TSE-SVB-2019-23 ข้อมูลเบื้องต้นในการพิจารณาการเสียหายของยางรถยนต์.pdf", year: 2019, file: "TSE-SVB-2019-23%20ข้อมูลเบื้องต้นในการพิจารณาการเสียหายของยางรถยนต์.pdf" ,tags: ["ล้อและยาง"] },
    { title: "TSE-SVB-2019-24 ข้อแนะนำขั้นตอนปฏิบัติงานและเพิ่มเติมรายการค่าแรงการเปลี่ยนฝาครอบราวหลังคา.pdf", year: 2019, file: "TSE-SVB-2019-24%20ข้อแนะนำขั้นตอนปฏิบัติงานและเพิ่มเติมรายการค่าแรงการเปลี่ยนฝาครอบราวหลังคา.pdf" ,tags: ["ค่าแรง"] },
    { title: "TSE-SVB-2019-25 ข้อแนะนำขั้นตอนการทำความสะอาดระบบน้ำหล่อเย็นก่อนเปลี่ยนหม้อน้ำ.pdf", year: 2019, file: "TSE-SVB-2019-25%20ข้อแนะนำขั้นตอนการทำความสะอาดระบบน้ำหล่อเย็นก่อนเปลี่ยนหม้อน้ำ.pdf" ,tags: ["ระบบหล่อเย็น","หม้อน้ำ"] },
    { title: "TSE-SVB-2019-26 ข้อแนะนำเกี่ยวกับก้านใบปัดน้ำฝนแบบแฟลตเบลด.pdf", year: 2019, file: "TSE-SVB-2019-26%20ข้อแนะนำเกี่ยวกับก้านใบปัดน้ำฝนแบบแฟลตเบลด.pdf" ,tags: ["ปัดน้ำฝน"] },
    { title: "TSE-SVB-2019-27 ข้อแนะนำเกี่ยวกับการติดตั้งอุปกรณ์เเสริมต่างๆ ที่รบกวนสัญญาณ GPS.pdf", year: 2019, file: "TSE-SVB-2019-27%20ข้อแนะนำเกี่ยวกับการติดตั้งอุปกรณ์เเสริมต่างๆ%20ที่รบกวนสัญญาณ%20GPS.pdf" ,tags: ["GPS"] },
    { title: "TSE-SVB-2019-28 คู่มือการใช้งานเบื้องต้น เครื่องเล่นวิทยุ Isuzu Ultimate Entertainment.pdf", year: 2019, file: "TSE-SVB-2019-28%20คู่มือการใช้งานเบื้องต้น%20เครื่องเล่นวิทยุ%20Isuzu%20Ultimate%20Entertainment.pdf" ,tags: ["วิทยุ","LCV"] },
    { title: "TSE-SVB-2019-29 ข้อควรระวังการปฏิบัติงานบริเวณคอนโซลหน้าฝั่งผู้โดยสาร.pdf", year: 2019, file: "TSE-SVB-2019-29%20ข้อควรระวังการปฏิบัติงานบริเวณคอนโซลหน้าฝั่งผู้โดยสาร.pdf" ,tags: ["คอนโซล"] },
    { title: "TSE-SVB-2019-30 ข้อแนะนำเกี่ยวกับการใช้น้ำมันไบโอดีเซลบี 10 สำหรับรถยนต์อีซูซุ.pdf", year: 2019, file: "TSE-SVB-2019-30%20ข้อแนะนำเกี่ยวกับการใช้น้ำมันไบโอดีเซลบี%2010%20สำหรับรถยนต์อีซูซุ.pdf" ,tags: ["B10","ระบบน้ำมันเชื้อเพลิง"] },
    { title: "TSE-SVB-2019-31 ข้อกำหนดการใช้ชนิดน้ำมันหล่อลื่นและของเหลวต่าง (All-New Isuzu D-Max รุ่นปี 2020).pdf", year: 2019, file: "TSE-SVB-2019-31%20ข้อกำหนดการใช้ชนิดน้ำมันหล่อลื่นและของเหลวต่าง%20(All-New%20Isuzu%20D-Max%20รุ่นปี%202020).pdf" ,tags: ["ระบบหล่อลื่น","น้ำมันเครื่อง","บำรุงรักษา"] },
    { title: "TSE-SVB-2019-32 การอัพเดทโปรแกรม G-IDSS.pdf", year: 2019, file: "TSE-SVB-2019-32%20การอัพเดทโปรแกรม%20G-IDSS.pdf" ,tags: ["GIDSS"] },
    { title: "TSE-SVB-2019-33 ข้อแนะนำการใช้งานฟังก์ชั่นระบบสตาร์ตเครื่องยนต์ด้วยรีโมท (ฉบับแก้ไข).pdf", year: 2019, file: "TSE-SVB-2019-33%20ข้อแนะนำการใช้งานฟังก์ชั่นระบบสตาร์ตเครื่องยนต์ด้วยรีโมท%20(ฉบับแก้ไข).pdf" ,tags: ["รีโมท","สตาร์ต"] },
    { title: "TSE-SVB-2019-34 ข้อมูลรหัสสีรถยนต์ ออลนิว อีซูซุดีแมคซ์.pdf", year: 2019, file: "TSE-SVB-2019-34%20ข้อมูลรหัสสีรถยนต์%20ออลนิว%20อีซูซุดีแมคซ์.pdf" ,tags: ["รหัสสี"] },
    { title: "TSE-SVB-2019-35 คู่มือมาตรฐานการคิดค่าแรง สำหรับออลนิว อีซูซุดีแมคซ์ ตั้งแต่รุ่นปี 2020.pdf", year: 2019, file: "TSE-SVB-2019-35%20คู่มือมาตรฐานการคิดค่าแรง%20สำหรับออลนิว%20อีซูซุดีแมคซ์%20ตั้งแต่รุ่นปี%202020.pdf" ,tags: ["LTG","ค่าแรง","D-MAX"] },
    { title: "TSE-SVB-2019-36 คู่มือมาตรฐานการคิดค่าแรง สำหรับรถดีแมคซ์ (รุ่นปี 2005 - 2019) และรถยนต์นั่งอเนกประสงค์.pdf.pdf", year: 2019, file: "TSE-SVB-2019-36%20คู่มือมาตรฐานการคิดค่าแรง%20สำหรับรถดีแมคซ์%20(รุ่นปี%202005%20-%202019)%20และรถยนต์นั่งอเนกประสงค์.pdf.pdf" ,tags: ["LTG","ค่าแรง","LCV"] },
    { title: "TSE-SVB-2019-37 คู่มือมาตรฐานการคิดค่าแรง สำหรับรถบรรทุกอีซูซุ ตระกูล N.pdf", year: 2019, file: "TSE-SVB-2019-37%20คู่มือมาตรฐานการคิดค่าแรง%20สำหรับรถบรรทุกอีซูซุ%20ตระกูล%20N.pdf" ,tags: ["LTG","ค่าแรง","N"] },
    { title: "TSE-SVB-2019-38 ข้อแนะนำเกี่ยวกับแบตเตอรี่ (Revised).pdf", year: 2019, file: "TSE-SVB-2019-38%20ข้อแนะนำเกี่ยวกับแบตเตอรี่%20(Revised).pdf" ,tags: ["แบตเตอรี่"] },
    { title: "TSE-SVB-2019-39 แจ้งเข้อมูลเกี่ยวกับข้อกำหนดการตั้งค่ามุมล้อหน้า.pdf", year: 2019, file: "TSE-SVB-2019-39%20แจ้งเข้อมูลเกี่ยวกับข้อกำหนดการตั้งค่ามุมล้อหน้า.pdf" ,tags: ["ล้อและยาง","การตั้งค่ามุม"] },
    { title: "TSE-SVB-2019-40 ขั้นตอนการตรวจเช็กและอัพเดทซอฟต์แวร์~องควบคุมเครื่องยนต์ (ECM) (ฉบับเพิ่มเติมข้อมูล).pdf", year: 2019, file: "TSE-SVB-2019-40%20ขั้นตอนการตรวจเช็กและอัพเดทซอฟต์แวร์~องควบคุมเครื่องยนต์%20(ECM)%20(ฉบับเพิ่มเติมข้อมูล).pdf" ,tags: ["ECM","การอัพเดตซอฟต์แวร์","ตรวจสอบ"] },
    { title: "TSE-SVB-2019-41 ข้อแนะนำเกี่ยวกับเซนเซอร์เรดาร์.pdf", year: 2019, file: "TSE-SVB-2019-41%20ข้อแนะนำเกี่ยวกับเซนเซอร์เรดาร์.pdf" ,tags: ["เรดาร์"] },
    { title: "TSE-SVB-2019-42 เพิ่มเติมรายการค่าแรงมาตรฐานอีซูซุ.pdf", year: 2019, file: "TSE-SVB-2019-42%20เพิ่มเติมรายการค่าแรงมาตรฐานอีซูซุ.pdf" ,tags: ["ค่าแรงมาตรฐาน"] },
    { title: "TSE-SVB-2020-01 การโปรแกรมกล่องควบคุม เครื่องเล่นวิทยุ และระบบปรับอากาศอัตโนมัติ", year: 2020, file: "TSE-SVB-2020-01%20การโปรแกรมกล่องควบคุม%20เครื่องเล่นวิทยุ%20และระบบปรับอากาศอัตโนมัติ.pdf" ,tags: ["ระบบปรับอากาศ","วิทยุ","โปรแกรม"]},
    { title: "TSE-SVB-2020-02 แจ้งข้อมูลระยะการบำรุงรักษารถบรรทุกอีซูซุรุ่นใหม่ NLR Lite", year: 2020, file: "TSE-SVB-2020-02%20แจ้งข้อมูลระยะการบำรุงรักษารถบรรทุกอีซูซุรุ่นใหม่%20NLR%20Lite.pdf",tags: ["NLR","บำรุงรักษา","N"] },
    { title: "TSE-SVB-2020-03 การอัพเดทโปรแกรม G-IDSS", year: 2020, file: "TSE-SVB-2020-03%20การอัพเดทโปรแกรม%20G-IDSS.pdf",tags: ["GIDSS","โปรแกรม","อัพเดท"] },
    { title: "TSE-SVB-2020-04 ข้อแนะนำการตรวจสอบหน้าปัดเรือนไมล์", year: 2020, file: "TSE-SVB-2020-04%20ข้อแนะนำการตรวจสอบหน้าปัดเรือนไมล์.pdf" ,tags: ["หน้าปัด"]},
    { title: "TSE-SVB-2020-05 ข้อแนะนำการบำรุงรักษาระบบลมและอุปกรณ์ดักจับความชื้น", year: 2020, file: "TSE-SVB-2020-05%20ข้อแนะนำการบำรุงรักษาระบบลมและอุปกรณ์ดักจับความชื้น.pdf" ,tags: ["ระบบลม","CV","บำรุงรักษา"]},
    { title: "TSE-SVB-2020-06 ข้อแนะนำเพิ่มเติมการดูแลรักษารถรอส่งมอบและรอการต่อตัวถัง", year: 2020, file: "TSE-SVB-2020-06%20ข้อแนะนำเพิ่มเติมการดูแลรักษารถรอส่งมอบและรอการต่อตัวถัง.pdf" ,tags: ["บำรุงรักษา","สต็อก","ตัวถัง"]},
    { title: "TSE-SVB-2020-07 การปรับปรุงรายการเกี่ยวกับค่าแรง", year: 2020, file: "TSE-SVB-2020-07%20การปรับปรุงรายการเกี่ยวกับค่าแรง.pdf" ,tags: ["ค่าแรง"]},
    { title: "TSE-SVB-2020-08 แจ้งการปรับปรุงรายการค่าแรงสำหรับชุดบำรุงรักษาตามระยะรูปแบบใหม่", year: 2020, file: "TSE-SVB-2020-08%20แจ้งการปรับปรุงรายการค่าแรงสำหรับชุดบำรุงรักษาตามระยะรูปแบบใหม่.pdf" ,tags: ["บำรุงรักษา","ค่าแรง"]},
    { title: "TSE-SVB-2020-09 ข้อควรระวังขณะทำการเปลี่ยนชิ้นส่วนระบบปรับอากาศ", year: 2020, file: "TSE-SVB-2020-09%20ข้อควรระวังขณะทำการเปลี่ยนชิ้นส่วนระบบปรับอากาศ.pdf",tags: ["ระบบปรับอากาศ"] },
    { title: "TSE-SVB-2020-10 ข้อควรระวังเกี่ยวกับการถอดประกอบแผงคอนโซลด้านหน้ารถ", year: 2020, file: "TSE-SVB-2020-10%20ข้อควรระวังเกี่ยวกับการถอดประกอบแผงคอนโซลด้านหน้ารถ.pdf",tags: ["คอนโซล"] },
    { title: "TSE-SVB-2020-11 การอัพเดทข้อมูลแผนที่ระบบนำทาง เวอร์ชั่น 2019.06 สำหรับวิทยุ CLARION.pdf", year: 2020, file: "TSE-SVB-2020-11%20การอัพเดทข้อมูลแผนที่ระบบนำทาง%20เวอร์ชั่น%202019.06%20สำหรับวิทยุ%20CLARION.pdf",tags: ["วิทยุ","CLARION","แผนที่"] },
    { title: "TSE-SVB-2020-12 ปัญหาเครื่องเล่นวิทยุทำงานผิดปกติจากการดัดแปลงชุดสายไฟ.pdf", year: 2020, file: "TSE-SVB-2020-12%20ปัญหาเครื่องเล่นวิทยุทำงานผิดปกติจากการดัดแปลงชุดสายไฟ.pdf",tags: ["ระบบไฟ","วิทยุ","ดัดแปลง"] },
    { title: "TSE-SVB-2020-13 การปรับปรุงระบบการสร้างเอกสารขอเสนอพิจารณาเคลม.pdf", year: 2020, file: "TSE-SVB-2020-13%20การปรับปรุงระบบการสร้างเอกสารขอเสนอพิจารณาเคลม.pdf" ,tags: ["เคลม","แบบฟอร์ม"] },
    { title: "TSE-SVB-2020-14 แจ้งเปลี่ยนแปลงข้อมูลการบำรุงรักษาสำ~ปรับลดราคาน้ำมันเกียร์แซดเอฟอีโคฟลูอิด SAE 75W-80.pdf", year: 2020, file: "TSE-SVB-2020-14%20แจ้งเปลี่ยนแปลงข้อมูลการบำรุงรักษาสำ~ปรับลดราคาน้ำมันเกียร์แซดเอฟอีโคฟลูอิด%20SAE%2075W-80.pdf" ,tags: ["ZF","น้ำมันเกียร์","ระบบเกียร์"] },
    { title: "TSE-SVB-2020-15 ข้อแนะนำและข้อควรระวังเกี่ยวกับการอัพเดทซอฟต์แวร์เครื่องเล่นวิทยุ.pdf", year: 2020, file: "TSE-SVB-2020-15%20ข้อแนะนำและข้อควรระวังเกี่ยวกับการอัพเดทซอฟต์แวร์เครื่องเล่นวิทยุ.pdf" ,tags: ["วิทยุ"] },
    { title: "TSE-SVB-2020-16 แจ้งข้อมูลเกี่ยวกับการเปลี่ยนแปลงรุ่~ัตโนมัติพร้อมกล้องบันทึกภาพวีดีโอด้านหน้า.pdf", year: 2020, file: "TSE-SVB-2020-16%20แจ้งข้อมูลเกี่ยวกับการเปลี่ยนแปลงรุ่~ัตโนมัติพร้อมกล้องบันทึกภาพวีดีโอด้านหน้า.pdf" ,tags: ["กล้องบันทึก"] },
    { title: "TSE-SVB-2020-17 การตรวจสอบและแก้ไขอาการแหนบมีเสียงดัง.pdf", year: 2020, file: "TSE-SVB-2020-17%20การตรวจสอบและแก้ไขอาการแหนบมีเสียงดัง.pdf" ,tags: ["เสียง","ระบบรองรับน้ำหนัก"] },
    { title: "TSE-SVB-2020-18 แจ้งเปลี่ยนแปลงข้อกำหนดและการตรวจสอบชนิดน้ำมันเกียร์.pdf", year: 2020, file: "TSE-SVB-2020-18%20แจ้งเปลี่ยนแปลงข้อกำหนดและการตรวจสอบชนิดน้ำมันเกียร์.pdf" ,tags: ["น้ำมันเกียร์"] },
    { title: "TSE-SVB-2020-19 แนวทางการตรวจสอบและดำเนินการกรณีพบน้~ยต่อระหว่างท้ายเครื่องยนต์กับหัวหมูเกียร์.pdf", year: 2020, file: "TSE-SVB-2020-19%20แนวทางการตรวจสอบและดำเนินการกรณีพบน้~ยต่อระหว่างท้ายเครื่องยนต์กับหัวหมูเกียร์.pdf" ,tags: ["ระบบเพลา","ระบบเครื่องยนต์"] },
    { title: "TSE-SVB-2020-20 ข้อแนะนำเพิ่มเติมเกี่ยวกับการดูแลรัก~ในสต็อก กรณีที่ต้องจอดรถไว้เป็นระยะเวลานาน.pdf", year: 2020, file: "TSE-SVB-2020-20%20ข้อแนะนำเพิ่มเติมเกี่ยวกับการดูแลรัก~ในสต็อก%20กรณีที่ต้องจอดรถไว้เป็นระยะเวลานาน.pdf" ,tags: ["สต็อก"] },
    { title: "TSE-SVB-2020-21 ข้อแนะนำเพิ่มเติมสำหรับรถที่มีแคมเพจ~ะกันเพิ่มเป็น 5 ปี ไม่จำกัดระยะทาง (ฉบับแก้ไข).pdf", year: 2020, file: "TSE-SVB-2020-21%20ข้อแนะนำเพิ่มเติมสำหรับรถที่มีแคมเพจ~ะกันเพิ่มเป็น%205%20ปี%20ไม่จำกัดระยะทาง%20(ฉบับแก้ไข).pdf" ,tags: ["แคมเพจน์"] },
    { title: "TSE-SVB-2020-22 ข้อกำหนดการใช้ชนิดน้ำมันหล่อลื่นและของเหลว สำหรับรถบรรทุก.pdf", year: 2020, file: "TSE-SVB-2020-22%20ข้อกำหนดการใช้ชนิดน้ำมันหล่อลื่นและของเหลว%20สำหรับรถบรรทุก.pdf" ,tags: ["บำรุงรักษา","น้ำมันเครื่อง"] },
    { title: "TSE-SVB-2020-23 อัพเดทข้อมูลแผนที่ระบบนำทาง เวอร์ชั่น 2020 สำหรับวิทยุ KENWOOD.pdf", year: 2020, file: "TSE-SVB-2020-23%20อัพเดทข้อมูลแผนที่ระบบนำทาง%20เวอร์ชั่น%202020%20สำหรับวิทยุ%20KENWOOD.pdf" ,tags: ["วิทยุ","KENWOOD","แผนที่"] },
    { title: "TSE-SVB-2020-24 ขั้นตอนการตรวจสอบและแก้ไขอาการสายเข็มขัดนิรภัยติดขัดไม่สามารถดึงออกมาใช้งานได้.pdf", year: 2020, file: "TSE-SVB-2020-24%20ขั้นตอนการตรวจสอบและแก้ไขอาการสายเข็มขัดนิรภัยติดขัดไม่สามารถดึงออกมาใช้งานได้.pdf" ,tags: ["เข็มขัด"] },
    { title: "TSE-SVB-2020-25 แจ้งข้อกำหนดใหม่ การใช้น้ำมันเกียร์แซดเอฟอีโคฟลูอิด SAE 75W-80.pdf", year: 2020, file: "TSE-SVB-2020-25%20แจ้งข้อกำหนดใหม่%20การใช้น้ำมันเกียร์แซดเอฟอีโคฟลูอิด%20SAE%2075W-80.pdf" ,tags: ["ZF","น้ำมันเกียร์","ระบบเกียร์"] },
    { title: "TSE-SVB-2020-26 การตรวจสอบท่อยางน้ำมันเกียร์อัตโนมัติ.pdf", year: 2020, file: "TSE-SVB-2020-26%20การตรวจสอบท่อยางน้ำมันเกียร์อัตโนมัติ.pdf" ,tags: ["น้ำมันเกียร์","ระบบเกียร์"] },
    { title: "TSE-SVB-2020-27 ข้อแนะนำเกี่ยวกับการตรวจสอบฝาครอบท่อหายใจของกล่องควบคุมเครื่องยนต์ (ECM).pdf", year: 2020, file: "TSE-SVB-2020-27%20ข้อแนะนำเกี่ยวกับการตรวจสอบฝาครอบท่อหายใจของกล่องควบคุมเครื่องยนต์%20(ECM).pdf" ,tags: ["ECM","ท่อหายใจ"] },
    { title: "TSE-SVB-2020-28 การอัพเดทโปรแกรม G-IDSS.pdf", year: 2020, file: "TSE-SVB-2020-28%20การอัพเดทโปรแกรม%20G-IDSS.pdf" ,tags: ["GIDSS"] },
    { title: "TSE-SVB-2020-29 การตรวจสอบและแก้ไขสายไฟกรองน้ำมันเชื้อเพลิง.pdf", year: 2020, file: "TSE-SVB-2020-29%20การตรวจสอบและแก้ไขสายไฟกรองน้ำมันเชื้อเพลิง.pdf" ,tags: ["ระบบน้ำมันเชื้อเพลิง","ไฟเตือน"] },
    { title: "TSE-SVB-2020-30 การเคลมสำหรับการตรวจสอบและปรับตั้งศูนย์ล้อ.pdf", year: 2020, file: "TSE-SVB-2020-30%20การเคลมสำหรับการตรวจสอบและปรับตั้งศูนย์ล้อ.pdf" ,tags: ["ล้อและยาง","เคลม"] },
    { title: "TSE-SVB-2020-31 ข้อแนะนำการตรวจสอบและการแก้ไขกรณีสวิตช์ยกเลี้ยวชำรุด.pdf", year: 2020, file: "TSE-SVB-2020-31%20ข้อแนะนำการตรวจสอบและการแก้ไขกรณีสวิตช์ยกเลี้ยวชำรุด.pdf" ,tags: ["สวิตช์ยกเลี้ยว"] },
    { title: "TSE-SVB-2020-32 การตรวจสอบค่าความดันลมยางให้ถูกต้อง ก่อนส่งมอบรถให้ลูกค้า.pdf", year: 2020, file: "TSE-SVB-2020-32%20การตรวจสอบค่าความดันลมยางให้ถูกต้อง%20ก่อนส่งมอบรถให้ลูกค้า.pdf" ,tags: ["ล้อและบาง","ความดัน"] },
    { title: "TSE-SVB-2020-33 ข้อควรระวังเกี่ยวกับการติดตั้งแขนยึดฝาท้าย.pdf", year: 2020, file: "TSE-SVB-2020-33%20ข้อควรระวังเกี่ยวกับการติดตั้งแขนยึดฝาท้าย.pdf" ,tags: ["ฝาท้าย","แขนยึด"] },
    { title: "TSE-SVB-2020-34 แจ้งข้อมูลเอกสารประกอบการใช้รถออลนิวอีซูซุมิว-เอ็กซ์.pdf", year: 2020, file: "TSE-SVB-2020-34%20แจ้งข้อมูลเอกสารประกอบการใช้รถออลนิวอีซูซุมิว-เอ็กซ์.pdf" ,tags: ["แบบฟอร์ม","MU-X"] },
    { title: "TSE-SVB-2020-35 ขั้นตอนการตรวจเช็กและอัพเดทซอฟต์แวร์กล่องควบคุมเครื่องยนต์ (ECM) .pdf", year: 2020, file: "TSE-SVB-2020-35%20ขั้นตอนการตรวจเช็กและอัพเดทซอฟต์แวร์กล่องควบคุมเครื่องยนต์%20(ECM)%20.pdf" ,tags: ["ECM","อัพเดท"] },
    { title: "TSE-SVB-2020-36 รายการอะไหล่เทคนิคเครื่องเล่นวิทยุและอุปกรณ์เพิ่มเติม.pdf", year: 2020, file: "TSE-SVB-2020-36%20รายการอะไหล่เทคนิคเครื่องเล่นวิทยุและอุปกรณ์เพิ่มเติม.pdf" ,tags: ["อะไหล่","วิทยุ"] },
    { title: "TSE-SVB-2020-37 การเชื่อมต่ออินเตอร์เน็ตขณะใช้งานโปรแกรม G-IDSS.pdf", year: 2020, file: "TSE-SVB-2020-37%20การเชื่อมต่ออินเตอร์เน็ตขณะใช้งานโปรแกรม%20G-IDSS.pdf" ,tags: ["GIDSS","อินเตอร์เน็ต"] },
    { title: "TSE-SVB-2020-38 ขั้นตอนการตรวจสอบรถเพิ่มเติม เมื่อเปล~์แซดเอฟ อีโคฟลูอิด%20SAE%2075W-80%20(กรณีตรวจเช็กตามระยะ).pdf", year: 2020, file: "TSE-SVB-2020-38%20ขั้นตอนการตรวจสอบรถเพิ่มเติม%20เมื่อเปล~์แซดเอฟ%20อีโคฟลูอิด%20SAE%2075W-80%20(กรณีตรวจเช็กตามระยะ).pdf" ,tags: ["ZF","น้ำมันเกียร์","ระบบเกียร์"] },
    { title: "TSE-SVB-2020-39 ข้อแนะนำและข้อควรระวังเกี่ยวกับการติดตั้งแกนพวงมาลัย.pdf", year: 2020, file: "TSE-SVB-2020-39%20ข้อแนะนำและข้อควรระวังเกี่ยวกับการติดตั้งแกนพวงมาลัย.pdf" ,tags: ["ระบบบังคับเลี้ยว"] },
    { title: "TSE-SVB-2021-01 แจ้งข้อมูลเพิ่มเติมเกี่ยวกับการอัพเด~บบนำทาง สำหรับเครื่องเล่นวิทยุ PANASONIC (รุ่น DVD NAVI).pdf", year: 2021, file: "TSE-SVB-2021-01%20แจ้งข้อมูลเพิ่มเติมเกี่ยวกับการอัพเด~บบนำทาง%20สำหรับเครื่องเล่นวิทยุ%20PANASONIC%20(รุ่น%20DVD%20NAVI).pdf",tags: ["วิทยุ", "แผนที่","PANASONIC","NAVI"] },
    { title: "TSE-SVB-2021-02 แจ้งขั้นตอนการตรวจสอบแบตเตอรี่และแบบฟอร์มใหม่.pdf", year: 2021, file: "TSE-SVB-2021-02%20แจ้งขั้นตอนการตรวจสอบแบตเตอรี่และแบบฟอร์มใหม่.pdf" ,tags: ["แบตเตอรี่", "แบบฟอร์ม"]},
    { title: "TSE-SVB-2021-03 การตรวจสอบและแก้ไขกันชนหน้าไม่เรียบเสมอกับตัวรถ.pdf", year: 2021, file: "TSE-SVB-2021-03%20การตรวจสอบและแก้ไขกันชนหน้าไม่เรียบเสมอกับตัวรถ.pdf" ,tags: ["กันชนหน้า"]},
    { title: "TSE-SVB-2021-04 แจ้งข้อมูลเกี่ยวกับการใช้งานและข้อคว~กสายไฟชุด เข็มขัดนิรภัยแบบดึงกลับอัตโนมัติ.pdf", year: 2021, file: "TSE-SVB-2021-04%20แจ้งข้อมูลเกี่ยวกับการใช้งานและข้อคว~กสายไฟชุด%20เข็มขัดนิรภัยแบบดึงกลับอัตโนมัติ.pdf" ,tags: ["ระบบไฟ", "เข็มขัด"]},
    { title: "TSE-SVB-2021-05 การอัพเดทข้อมูลแผนที่ระบบนำทาง เครื่องเล่นวิทยุ DENSO TEN.pdf", year: 2021, file: "TSE-SVB-2021-05%20การอัพเดทข้อมูลแผนที่ระบบนำทาง%20เครื่องเล่นวิทยุ%20DENSO%20TEN.pdf" ,tags: ["วิทยุ", "KENWOOD", "แผนที่"]},
    { title: "TSE-SVB-2021-06 แจ้งข้อมูลเกี่ยวกับการเปลี่ยนแปลงรูปแบบของอ่างน้ำมันเครื่องแบบใหม่.pdf", year: 2021, file: "TSE-SVB-2021-06%20แจ้งข้อมูลเกี่ยวกับการเปลี่ยนแปลงรูปแบบของอ่างน้ำมันเครื่องแบบใหม่.pdf",tags: ["ระบบหล่อลื่น", "น้ำมันเครื่อง", "อ่าง"] },
    { title: "TSE-SVB-2021-07 แจ้งการตรวจสอบประตูท้ายไฟฟ้าเพิ่มเติม ในขั้นตอนการตรวจ PDS ก่อนส่งมอบรถใหม่.pdf", year: 2021, file: "TSE-SVB-2021-07%20แจ้งการตรวจสอบประตูท้ายไฟฟ้าเพิ่มเติม%20ในขั้นตอนการตรวจ%20PDS%20ก่อนส่งมอบรถใหม่.pdf",tags: ["รถใหม่", "ประตูท้าย", "สต็อก"] },
    { title: "TSE-SVB-2021-08 แนวทางการปฏิบัติงานเมื่อพบกรณีรอยน้ำซึมบริเวณแผ่นบุหลังคา.pdf", year: 2021, file: "TSE-SVB-2021-08%20แนวทางการปฏิบัติงานเมื่อพบกรณีรอยน้ำซึมบริเวณแผ่นบุหลังคา.pdf",tags: ["แผ่นบุคลังคา", "น้ำซึม"] },
    { title: "TSE-SVB-2021-09 แจ้งวิธีการตรวจสอบลักษณะความเสียหายของลูกปืน [Revised].pdf", year: 2021, file: "TSE-SVB-2021-09%20แจ้งวิธีการตรวจสอบลักษณะความเสียหายของลูกปืน%20[Revised].pdf",tags: ["ลูกปืน", "ล้อและยาง"] },
    { title: "TSE-SVB-2021-09 แจ้งวิธีการตรวจสอบลักษณะความเสียหายของลูกปืน.pdf", year: 2021, file: "TSE-SVB-2021-09%20แจ้งวิธีการตรวจสอบลักษณะความเสียหายของลูกปืน.pdf" ,tags: ["ลูกปืน", "ล้อและยาง"]},
    { title: "TSE-SVB-2021-10 แนวทางการปฏิบัติงานและการแก้ไข กรณีพบ~ต่อท่อยางน้ำมันเชื้อเพลิงไหลกลับจากหัวฉีด.pdf", year: 2021, file: "TSE-SVB-2021-10%20แนวทางการปฏิบัติงานและการแก้ไข%20กรณีพบ~ต่อท่อยางน้ำมันเชื้อเพลิงไหลกลับจากหัวฉีด.pdf" ,tags: ["น้ำมันเชื้อเพลิง", "ระบบเชื้อเพลิง", "หัวฉีด"]},
    { title: "TSE-SVB-2021-11 แนวทางการป้องกันกรณีโคมไฟแตกร้าว.pdf", year: 2021, file: "TSE-SVB-2021-11%20แนวทางการป้องกันกรณีโคมไฟแตกร้าว.pdf" ,tags: ["โคมไฟ", "ระบบไฟ"]},
    { title: "TSE-SVB-2021-12 อัพเดทข้อมูลแผนที่ระบบนำทางเวอร์ชั่น 2021 สำหรับวิทยุ KENWOOD (รุ่น DNX7150BT) .pdf", year: 2021, file: "TSE-SVB-2021-12%20อัพเดทข้อมูลแผนที่ระบบนำทางเวอร์ชั่น%202021%20สำหรับวิทยุ%20KENWOOD%20(รุ่น%20DNX7150BT)%20.pdf",tags: ["วิทยุ", "KEENWOOD", "แผนที่"] },
    { title: "TSE-SVB-2021-13 ข้อแนะนำการตรวจสอบและแนวทางปฏิบัติกรณีพบการรั่วซึมของน้ำหล่อเย็นที่ปะเก็นฝาสูบ.pdf", year: 2021, file: "TSE-SVB-2021-13%20ข้อแนะนำการตรวจสอบและแนวทางปฏิบัติกรณีพบการรั่วซึมของน้ำหล่อเย็นที่ปะเก็นฝาสูบ.pdf",tags: ["ระบบหล่อเย็น", "น้ำหล่อเย็น", "รั่ว"] },
    { title: "TSE-SVB-2021-15 ข้อแนะนำแนวทางปฏิบัติงานกรณีพบการเสียหายของปั๊มมือ.pdf", year: 2021, file: "TSE-SVB-2021-15%20ข้อแนะนำแนวทางปฏิบัติงานกรณีพบการเสียหายของปั๊มมือ.pdf",tags: ["ปั้มมือ", "น้ำมันเชื้อเพลิง"] },
    { title: "TSE-SVB-2021-16 แจ้งเน้นย้ำการตรวจเช็กสลักล็อกและนอต~สื้อเพลาท้ายที่ยึดกับแขนรับแรงบิดรูปตัววี.pdf", year: 2021, file: "TSE-SVB-2021-16%20แจ้งเน้นย้ำการตรวจเช็กสลักล็อกและนอต~สื้อเพลาท้ายที่ยึดกับแขนรับแรงบิดรูปตัววี.pdf",tags: ["ล้อและยาง", "นอตล้อ", "น้ำมันเกียร์","ระบบเกียร์"] },
    { title: "TSE-SVB-2021-17 งานบริการจาระบีลูกปืนล้อ-ดุมล้อ และปริมาณจาระบีดุมล้อที่แนะนำ.pdf", year: 2021, file: "TSE-SVB-2021-17%20งานบริการจาระบีลูกปืนล้อ-ดุมล้อ%20และปริมาณจาระบีดุมล้อที่แนะนำ.pdf" ,tags: ["จาระบี", "ดุมล้อ","ล้อและยาง"]},
    { title: "TSE-SVB-2021-18 แจ้งการปรับปรุงรายการค่าแรงสำหรับงานอัดจาระบีตามจุดและปริมาณจาระบีที่ใช้.pdf", year: 2021, file: "TSE-SVB-2021-18%20แจ้งการปรับปรุงรายการค่าแรงสำหรับงานอัดจาระบีตามจุดและปริมาณจาระบีที่ใช้.pdf",tags: ["ค่าแรง", "จาระบี", "ล้อและยาง"] },
    { title: "TSE-SVB-2021-19 แจ้งเน้นย้ำข้อกำหนด การใช้น้ำมันเกียร์แซดเอฟอีโคฟลูอิด SAE 75W-80.pdf", year: 2021, file: "TSE-SVB-2021-19%20แจ้งเน้นย้ำข้อกำหนด%20การใช้น้ำมันเกียร์แซดเอฟอีโคฟลูอิด%20SAE%2075W-80.pdf" ,tags: ["ZF", "น้ำมันเกียร์","ระบบเกียร์"]},
    { title: "TSE-SVB-2021-20 ข้อแนะนำและแนวทางปฏิบัติงาน กรณีพบการ~สภาพของแบตเตอรี่ยี่ห้อ 3K ชนิดเติมน้ำกลั่น (CVT).pdf", year: 2021, file: "TSE-SVB-2021-20%20ข้อแนะนำและแนวทางปฏิบัติงาน%20กรณีพบการ~สภาพของแบตเตอรี่ยี่ห้อ%203K%20ชนิดเติมน้ำกลั่น%20(CVT).pdf",tags: ["แบตเตอรี่", "น้ำกลั่น"] },
    { title: "TSE-SVB-2022-01 แจ้งเน้นย้ำการรีเซ็ตค่าระบบแจ้งเตือนเข้ารับบริการบำรุงรักษาตามระยะ.pdf", year: 2022, file: "TSE-SVB-2022-01%20แจ้งเน้นย้ำการรีเซ็ตค่าระบบแจ้งเตือนเข้ารับบริการบำรุงรักษาตามระยะ.pdf" ,tags: ["บำรุงรักษา", "reminder", "รีเซ็ต"]},
    { title: "TSE-SVB-2022-02 ข้อแนะนำขั้นตอนปฏิบัติเกี่ยวกับการถ่วงล้อที่ถูกต้อง.pdf", year: 2022, file: "TSE-SVB-2022-02%20ข้อแนะนำขั้นตอนปฏิบัติเกี่ยวกับการถ่วงล้อที่ถูกต้อง.pdf" ,tags: ["ถ่วงล้อ"]},
    { title: "TSE-SVB-2022-03 แนะนำช่องทางใหม่ในการใช้งานคู่มือการซ่อมผ่านระบบ Google Drive.pdf", year: 2022, file: "TSE-SVB-2022-03%20แนะนำช่องทางใหม่ในการใช้งานคู่มือการซ่อมผ่านระบบ%20Google%20Drive.pdf" ,tags: ["คู่มือการซ่อม"]},
    { title: "TSE-SVB-2022-04 ทดสอบกลไกการทำงานของเกียร์อัตโนมัติของรถใหม่ในสต็อกก่อนส่งมอบรถ.pdf", year: 2022, file: "TSE-SVB-2022-04%20ทดสอบกลไกการทำงานของเกียร์อัตโนมัติของรถใหม่ในสต็อกก่อนส่งมอบรถ.pdf",tags: ["รถใหม่", "เกียร์", "สต็อก"] },
    { title: "TSE-SVB-2022-05 แนะนำน้ำมันตรีเพชร 15W 40 CI-4 (เครื่องยนต์ เกียร์).pdf", year: 2022, file: "TSE-SVB-2022-05%20แนะนำน้ำมันตรีเพชร%2015W%2040%20CI-4%20(เครื่องยนต์%20เกียร์).pdf" ,tags: ["ตรีเพชร", "น้ำมันเครื่อง", "น้ำมันเกียร์"]},
    { title: "TSE-SVB-2022-06 งานบริการจาระบีลูกปืนล้อ-ดุมล้อ และปร~ณจาระบีดุมล้อที่แนะนำ (ฉบับเพิ่มเติมข้อมูล).pdf", year: 2022, file: "TSE-SVB-2022-06%20งานบริการจาระบีลูกปืนล้อ-ดุมล้อ%20และปร~ณจาระบีดุมล้อที่แนะนำ%20(ฉบับเพิ่มเติมข้อมูล).pdf",tags: ["ดุมล้อ", "จาระบี","ล้อและยาง"] },
    { title: "TSE-SVB-2022-07 แจ้งเปลี่ยนแปลงแนวทางการตรวจสอบเพิ่ม~เอฟอีโคฟลูอิด SAE 75W-80 สำหรับรถนอกระยะรับประกัน.pdf", year: 2022, file: "TSE-SVB-2022-07%20แจ้งเปลี่ยนแปลงแนวทางการตรวจสอบเพิ่ม~เอฟอีโคฟลูอิด%20SAE%2075W-80%20สำหรับรถนอกระยะรับประกัน.pdf",tags: ["ZF", "น้ำมันเกียร์", "ระบบเกียร์"] },
    { title: "TSE-SVB-2022-08 ข้อแนะนำเพิ่มเติมในการล้างทำความสะอาดแผงทำความเย็นของระบบปรับอากาศ (ฉบับแก้ไข).pdf", year: 2022, file: "TSE-SVB-2022-08%20ข้อแนะนำเพิ่มเติมในการล้างทำความสะอาดแผงทำความเย็นของระบบปรับอากาศ%20(ฉบับแก้ไข).pdf" ,tags: ["ระบบปรับอากาศ"]},
    { title: "TSE-SVB-2022-09 แนวทางการปฏิบัติงานกรณีพบอาการเข็มวัดระดับน้ำมันทำงานผิดปกติ.pdf", year: 2022, file: "TSE-SVB-2022-09%20แนวทางการปฏิบัติงานกรณีพบอาการเข็มวัดระดับน้ำมันทำงานผิดปกติ.pdf",tags: ["หน้าปัด"] },
    { title: "TSE-SVB-2022-10 แนวทางการปฏิบัติงานกรณีพบอาการเครื่องยนต์มีเสียงดังผิดปกติ.pdf", year: 2022, file: "TSE-SVB-2022-10%20แนวทางการปฏิบัติงานกรณีพบอาการเครื่องยนต์มีเสียงดังผิดปกติ.pdf",tags: ["เสียง", "ระบบเครื่องยนต์"] },
    { title: "TSE-SVB-2022-11 แจ้งแนวทางการบำรุงรักษาเชิงป้องกัน ก่~ี่ยนมาใช้น้ำมัน เกียร์แซดเอฟอีโคฟลูอิด SAE 75W-80.pdf", year: 2022, file: "TSE-SVB-2022-11%20แจ้งแนวทางการบำรุงรักษาเชิงป้องกัน%20ก่~ี่ยนมาใช้น้ำมัน%20เกียร์แซดเอฟอีโคฟลูอิด%20SAE%2075W-80.pdf",tags: ["น้ำมันเกียร์", "ZF"] },
    { title: "TSE-SVB-2022-12 แจ้งวิธีการตรวจสอบและแนวทางปฏิบัติงาน กรณีพบอาการรถพวงมาลัยเอียง .pdf", year: 2022, file: "TSE-SVB-2022-12%20แจ้งวิธีการตรวจสอบและแนวทางปฏิบัติงาน%20กรณีพบอาการรถพวงมาลัยเอียง%20.pdf",tags: ["พวงมาลัย", "ระบบบังคับเลี้ยว"] },
    { title: "TSE-SVB-2022-13 ข้อแนะนำและข้อควรระวังเพิ่มเติม ในขั้นตอนการถอดประกอบฝาครอบตอนที่ 3 .pdf", year: 2022, file: "TSE-SVB-2022-13%20ข้อแนะนำและข้อควรระวังเพิ่มเติม%20ในขั้นตอนการถอดประกอบฝาครอบตอนที่%203%20.pdf",tags: ["ถอด-ประกอบ", "ฝาครอบ"] },
    { title: "TSE-SVB-2022-14 แนวทางการแก้ไขกรณีพบอาการดุมล้อหน้าฝืด ติดขัด หรือมีรอยไหม้ .pdf", year: 2022, file: "TSE-SVB-2022-14%20แนวทางการแก้ไขกรณีพบอาการดุมล้อหน้าฝืด%20ติดขัด%20หรือมีรอยไหม้%20.pdf",tags: ["ดุมล้อ", "แก้ไข"] },
    { title: "TSE-SVB-2022-15 แจ้งขั้นตอนการดำเนินการขอตรวจสอบเกียร์ 4X4 (MVL6S) .pdf", year: 2022, file: "TSE-SVB-2022-15%20แจ้งขั้นตอนการดำเนินการขอตรวจสอบเกียร์%204X4%20(MVL6S)%20.pdf" ,tags: ["ระบบเกียร์", "MVL"]},
    { title: "TSE-SVB-2022-16 แนวทางการปฏิบัติงานสำหรับปัญหาสีลอก.pdf", year: 2022, file: "TSE-SVB-2022-16%20แนวทางการปฏิบัติงานสำหรับปัญหาสีลอก.pdf",tags: ["สี", "ปัญหา"] },
    { title: "TSE-SVB-2022-17 อัพเดทข้อมูลแผนที่ระบบนำทางเวอร์ชัน 2022 สำหรับวิทยุ KENWOOD รุ่น DNX7150BT .pdf", year: 2022, file: "TSE-SVB-2022-17%20อัพเดทข้อมูลแผนที่ระบบนำทางเวอร์ชัน%202022%20สำหรับวิทยุ%20KENWOOD%20รุ่น%20DNX7150BT%20.pdf",tags: ["วิทยุ", "KENWOOD","แผนที่"] },
    { title: "TSE-SVB-2022-18 แจ้งข้อมูลเพิ่มเติมเกี่ยวกับสมุดคู่มือใช้รถสำหรับลูกค้าแบบใหม่.pdf", year: 2022, file: "TSE-SVB-2022-18%20แจ้งข้อมูลเพิ่มเติมเกี่ยวกับสมุดคู่มือใช้รถสำหรับลูกค้าแบบใหม่.pdf" ,tags: ["คู่มือการใช้"]},
    { title: "TSE-SVB-2022-19 แจ้งวิธีการตรวจสอบแบตเตอรี่ด้วยเครื่องทดสอบแบตเตอรี่ (ฉบับปรับปรุง) .pdf", year: 2022, file: "TSE-SVB-2022-19%20แจ้งวิธีการตรวจสอบแบตเตอรี่ด้วยเครื่องทดสอบแบตเตอรี่%20(ฉบับปรับปรุง)%20.pdf",tags: ["แบตเตอรี่"] },
    { title: "TSE-SVB-2022-20 แจ้งข้อมูลเพิ่มเติมเกี่ยวกับคู่มือการใช้รถ (Owner Manual) แบบใหม่ (รถบรรทุกตระกูล F&G) .pdf", year: 2022, file: "TSE-SVB-2022-20%20แจ้งข้อมูลเพิ่มเติมเกี่ยวกับคู่มือการใช้รถ%20(Owner%20Manual)%20แบบใหม่%20(รถบรรทุกตระกูล%20F&G)%20.pdf",tags: ["คู่มือการใช้", "F&G"] },
    { title: "TSE-SVB-2023-01 แจ้งข้อมูลเพิ่มเติมเกี่ยวกับคู่มือการใช้รถ (Owner Manual) แบบใหม่ (รถบรรทุกตระกูล N).pdf", year: 2023, file: "TSE-SVB-2023-01%20แจ้งข้อมูลเพิ่มเติมเกี่ยวกับคู่มือการใช้รถ%20(Owner%20Manual)%20แบบใหม่%20(รถบรรทุกตระกูล%20N).pdf",tags: ["คู่มือการใช้", "N"] },
    { title: "TSE-SVB-2023-02 เครื่องยนต์สตาร์ตไม่ติด หลังจากเข้ารับบริการโครงการพิเศษ ตรวจเช็กกล่อง ECM 3.0 (4JJ3).pdf", year: 2023, file: "TSE-SVB-2023-02%20เครื่องยนต์สตาร์ตไม่ติด%20หลังจากเข้ารับบริการโครงการพิเศษ%20ตรวจเช็กกล่อง%20ECM%203.0%20(4JJ3).pdf",tags: ["ระบบเครื่องยนต์", "โครงการพิเศษ"] },
    { title: "TSE-SVB-2023-03 การดูแลรักษายางรถยนต์ สำหรับรถที่จอดรอในสต็อก .pdf", year: 2023, file: "TSE-SVB-2023-03%20การดูแลรักษายางรถยนต์%20สำหรับรถที่จอดรอในสต็อก%20.pdf",tags: ["ล้อและยาง", "รักษา","สต็อก"] },
    { title: "TSE-SVB-2023-04 ข้อปฏิบัติหลังจากเปลี่ยนชุดแผงหน้าปัดใหม่ สำหรับรถยนต์ที่ติดตั้งระบบ TELETEC .pdf", year: 2023, file: "TSE-SVB-2023-04%20ข้อปฏิบัติหลังจากเปลี่ยนชุดแผงหน้าปัดใหม่%20สำหรับรถยนต์ที่ติดตั้งระบบ%20TELETEC%20.pdf",tags: ["TELETEC", "หน้าปัด"] },
    { title: "TSE-SVB-2023-05 แนวทางการวิเคราะห์ความเสียหายที่เกิดขึ้นกับสีรถยนต์ .pdf", year: 2023, file: "TSE-SVB-2023-05%20แนวทางการวิเคราะห์ความเสียหายที่เกิดขึ้นกับสีรถยนต์%20.pdf" ,tags: ["สี", "ปัญหา"]},
    { title: "TSE-SVB-2023-06 แนวทางการปฏิบัติงานกรณีพบคราบน้ำหล่อเย็นบริเวณรอยต่อหน้าแปลนปั๊มน้ำและเสื้อสูบ.pdf", year: 2023, file: "TSE-SVB-2023-06%20แนวทางการปฏิบัติงานกรณีพบคราบน้ำหล่อเย็นบริเวณรอยต่อหน้าแปลนปั๊มน้ำและเสื้อสูบ.pdf" ,tags: ["ระบบหล่อเย็น", "ปั้มน้ำ","ปัญหา"]},
    { title: "TSE-SVB-2023-07 แนวทางการแก้ไขเบื้องต้นเฉพาะกรณีใช้ง~ามารถโปรแกรม ID หัวฉีดได้ (ฉบับแก้ไขเพิ่มเติม).pdf", year: 2023, file: "TSE-SVB-2023-07%20แนวทางการแก้ไขเบื้องต้นเฉพาะกรณีใช้ง~ามารถโปรแกรม%20ID%20หัวฉีดได้%20(ฉบับแก้ไขเพิ่มเติม).pdf",tags: ["GIDSS", "โปรแกรม","หัวฉีด"] },
    { title: "TSE-SVB-2023-08 แจ้งข้อมูลเพิ่มเติมเกี่ยวกับคู่มือการใช้รถ แบบใหม่ (NPR MINIBUS CHASSIS).pdf", year: 2023, file: "TSE-SVB-2023-08%20แจ้งข้อมูลเพิ่มเติมเกี่ยวกับคู่มือการใช้รถ%20แบบใหม่%20(NPR%20MINIBUS%20CHASSIS).pdf" ,tags: ["คู่มือการรถ", "N","MINIBUS"]},
    { title: "TSE-SVB-2023-09 ข้อแนะนำการแก้ไขกรณี DRM Data Reader (3.9.8) ไม่สามารถดาวน์โหลดข้อมูล DRM ได้.pdf", year: 2023, file: "TSE-SVB-2023-09%20ข้อแนะนำการแก้ไขกรณี%20DRM%20Data%20Reader%20(3.9.8)%20ไม่สามารถดาวน์โหลดข้อมูล%20DRM%20ได้.pdf",tags: ["DRM"] },
    { title: "TSE-SVB-2023-12 แนวทางการปฎิบัติงาน กรณีพบเศษฟองน้ำบริเวณใต้เบาะนั่งด้านหน้า.pdf", year: 2023, file: "TSE-SVB-2023-12%20แนวทางการปฎิบัติงาน%20กรณีพบเศษฟองน้ำบริเวณใต้เบาะนั่งด้านหน้า.pdf" ,tags: ["เบาะนั่ง"]},
    { title: "TSE-SVB-2023-13 ข้อแนะนำเกี่ยวกับการเลือกใช้ยาง การต~ถยนต์ สำหรับรถยนต์อีซูซุรุ่นขับเคลื่อน 4 ล้อ.pdf", year: 2023, file: "TSE-SVB-2023-13%20ข้อแนะนำเกี่ยวกับการเลือกใช้ยาง%20การต~ถยนต์%20สำหรับรถยนต์อีซูซุรุ่นขับเคลื่อน%204%20ล้อ.pdf",tags: ["ล้อและยาง"] },
    { title: "TSE-SVB-2023-14 ข้อควรระวังสำหรับการทาปะเก็นเหลวในขั้นตอนการประกอบเครื่องยนต์.pdf", year: 2023, file: "TSE-SVB-2023-14%20ข้อควรระวังสำหรับการทาปะเก็นเหลวในขั้นตอนการประกอบเครื่องยนต์.pdf",tags: ["ปะเก็นเหลว", "ระบบเครื่องยนต์"] },
    { title: "TSE-SVB-2023-15 แนะนำการแลกเปลี่ยนผลิตภัณฑ์ปั๊มและหั~ระบบน้ำมันเชื้อเพลิงของศูนย์บริการเด็นโซ่.pdf", year: 2023, file: "TSE-SVB-2023-15%20แนะนำการแลกเปลี่ยนผลิตภัณฑ์ปั๊มและหั~ระบบน้ำมันเชื้อเพลิงของศูนย์บริการเด็นโซ่.pdf" ,tags: ["Denso","ระบบน้ำมันเชื้อเพลิง","หัวฉีด"] },
    { title: "TSE-SVB-2023-16 แจ้งข้อมูลการใช้งานฟังก์ชัน “CPS 2.0” ในโปรแกรม G-IDSS.pdf", year: 2023, file: "TSE-SVB-2023-16%20แจ้งข้อมูลการใช้งานฟังก์ชัน%20“CPS%202.0”%20ในโปรแกรม%20G-IDSS.pdf",tags: ["GIDSS"] },
    { title: "TSE-SVB-2024-01 ขั้นตอนการตรวจสอบและการเรียนรู้ระบบกล้อง 360 องศา.pdf", year: 2024, file: "TSE-SVB-2024-01%20ขั้นตอนการตรวจสอบและการเรียนรู้ระบบกล้อง%20360%20องศา.pdf",tags: ["กล้อง", "เรียนรู้"] },
    { title: "TSE-SVB-2024-02 แนวทางปฏิบัติงานและการแก้ไข กรณีเฟืองท้ายมีเสียงการทำงานผิดปกติขณะใช้งาน.pdf", year: 2024, file: "TSE-SVB-2024-02%20แนวทางปฏิบัติงานและการแก้ไข%20กรณีเฟืองท้ายมีเสียงการทำงานผิดปกติขณะใช้งาน.pdf",tags: ["เฟืองท้าย", "ระบบเพลา"] },
    { title: "TSE-SVB-2024-03 ข้อแนะนำเกี่ยวกับการหลีกเลี่ยงการใช้~นรถที่มีผลกระทบต่อการรับสัญญาณ GPS ของระบบ TELETEC.pdf", year: 2024, file: "TSE-SVB-2024-03%20ข้อแนะนำเกี่ยวกับการหลีกเลี่ยงการใช้~นรถที่มีผลกระทบต่อการรับสัญญาณ%20GPS%20ของระบบ%20TELETEC.pdf",tags: ["TELETEC"] },
    { title: "TSE-SVB-2024-04 แจ้งแนวทางการปฏิบัติงาน กรณีพบอาการหน้าจอวิทยุทำงานผิดปกติ.pdf", year: 2024, file: "TSE-SVB-2024-04%20แจ้งแนวทางการปฏิบัติงาน%20กรณีพบอาการหน้าจอวิทยุทำงานผิดปกติ.pdf",tags: ["วิทยุ"] },
    { title: "TSE-SVB-2024-05 แจ้งข้อกำหนดการเข้ารับบริการบำรุงรัก~ยะ การใช้ชนิดน้ำมันหล่อลื่นและของเหลวต่างๆ.pdf", year: 2024, file: "TSE-SVB-2024-05%20แจ้งข้อกำหนดการเข้ารับบริการบำรุงรัก~ยะ%20การใช้ชนิดน้ำมันหล่อลื่นและของเหลวต่างๆ.pdf",tags: ["น้ำมันเครื่อง", "บำรุงรักษา"] },
    { title: "TSE-SVB-2024-06 แจ้งแนวทางการปฏิบัติงานและการแก้ไข กร~าการหน้าจอวิทยุทำงานผิดปกติ (ฉบับเพิ่มเติม).pdf", year: 2024, file: "TSE-SVB-2024-06%20แจ้งแนวทางการปฏิบัติงานและการแก้ไข%20กร~าการหน้าจอวิทยุทำงานผิดปกติ%20(ฉบับเพิ่มเติม).pdf",tags: ["วิทยุ"] },
    { title: "TSE-SVB-2024-07 แจ้งเน้นย้ำวิธีการขันนอตดุมล้อ ในขั้นตอนการเปลี่ยนจาระบีลูกปืนล้อ(กรณีไม่ถอดล้อ).pdf", year: 2024, file: "TSE-SVB-2024-07%20แจ้งเน้นย้ำวิธีการขันนอตดุมล้อ%20ในขั้นตอนการเปลี่ยนจาระบีลูกปืนล้อ(กรณีไม่ถอดล้อ).pdf",tags: ["นอต", "ดุมล้อ","ระบบเพลา"] },
    { title: "TSE-SVB-2024-08 การใช้น้ำมันเครื่องประเภทเถ้าต่ำ (Low Ash) (ฉบับแก้ไขเพิ่มเติม).pdf", year: 2024, file: "TSE-SVB-2024-08%20การใช้น้ำมันเครื่องประเภทเถ้าต่ำ%20(Low%20Ash)%20(ฉบับแก้ไขเพิ่มเติม).pdf",tags: ["น้ำมันเครื่อง", "เถ้ำต่ำ","ยูโร 5"] },
    { title: "TSE-SVB-2024-09 แจ้งยกเลิกการบำรุงรักษาครั้งแรกที่ระยะทาง 1,000 กิโลเมตร.pdf", year: 2024, file: "TSE-SVB-2024-09%20แจ้งยกเลิกการบำรุงรักษาครั้งแรกที่ระยะทาง%201,000%20กิโลเมตร.pdf",tags: ["บำรุงรักษา","ยกเลิก"] },
    { title: "TSE-SVB-2024-10 การเข้ารับบริการบำรุงรักษาตามระยะ การใช้ชนิดน้ำมันหล่อลื่นและของเหลวต่างๆ.pdf", year: 2024, file: "TSE-SVB-2024-10%20การเข้ารับบริการบำรุงรักษาตามระยะ%20การใช้ชนิดน้ำมันหล่อลื่นและของเหลวต่างๆ.pdf",tags: ["น้ำมันเครื่อง", "บำรุงรักษา"] },
    { title: "TSE-SVB-2024-11 ข้อแนะนำและข้อควรระวังในการติดตั้งฟิล์มกรองแสงที่กระจกบังลมหน้า สำหรับรถที่.pdf", year: 2024, file: "TSE-SVB-2024-11%20ข้อแนะนำและข้อควรระวังในการติดตั้งฟิล์มกรองแสงที่กระจกบังลมหน้า%20สำหรับรถที่.pdf",tags: ["ฟิล์ม", "กล้องหน้า"] },
    { title: "TSE-SVB-2025-01 แจ้งข้อมูลการสิ้นสุดการสนับสนุนโปรแกรม G-IDSS บนระบบปฏิบัติการ Windows 10.pdf", year: 2025, file: "TSE-SVB-2025-01%20แจ้งข้อมูลการสิ้นสุดการสนับสนุนโปรแกรม%20G-IDSS%20บนระบบปฏิบัติการ%20Windows%2010.pdf",tags: ["GIDSS", "Windows 10"]},
    { title: "TSE-SVB-2025-02 แจ้งรายละเอียดการอัพเดทซอฟต์แวร์วิทย~นาดหน้าจอ 8 นิ้วและ 9 นิ้ว) (ฉบับแก้ไขเพิ่มเ.pdf", year: 2025, file: "TSE-SVB-2025-02%20แจ้งรายละเอียดการอัพเดทซอฟต์แวร์วิทย~นาดหน้าจอ%208%20นิ้วและ%209%20นิ้ว)%20(ฉบับแก้ไขเพิ่มเ.pdf",tags: ["วิทยุ", "Denso-ten","อัพเดท"] },
    { title: "TSE-SVB-2025-03 วิธีการดาวน์โหลดข้อมูล DRM ด้วยโปรแกรม DRM Data Reader.pdf", year: 2025, file: "TSE-SVB-2025-03%20วิธีการดาวน์โหลดข้อมูล%20DRM%20ด้วยโปรแกรม%20DRM%20Data%20Reader.pdf",tags: ["DRM", "GIDSS"] },
    { title: "TSE-SVB-2025-04 แจ้งข้อกำหนดการเข้ารับบริการบำรุงรัก~ละของเหลวต่างๆ (รถบรรทุกอีซูซูตระกูล N ยูโร 5).pdf", year: 2025, file: "TSE-SVB-2025-04%20แจ้งข้อกำหนดการเข้ารับบริการบำรุงรัก~ละของเหลวต่างๆ%20(รถบรรทุกอีซูซูตระกูล%20N%20ยูโร%205).pdf",tags: ["น้ำมันเครื่อง", "บำรุงรักษา","ยูโร 5","N"] },
    { title: "TSE-SVB-2025-05 แจ้งข้อกำหนดการเข้ารับบริการบำรุงรัก~งเหลวต่างๆ (รถบรรทุกอีซูซูตระกูล F และ G ยูโร 5).pdf", year: 2025, file: "TSE-SVB-2025-05%20แจ้งข้อกำหนดการเข้ารับบริการบำรุงรัก~งเหลวต่างๆ%20(รถบรรทุกอีซูซูตระกูล%20F%20และ%20G%20ยูโร%205).pdf",tags: ["น้ำมันเครื่อง", "บำรุงรักษา","ยูโร 5","F&G"] },
    { title: "TSE-SVB-2025-06 แนวทางการแจ้งปัญหารถใหม่ก่อนการจำหน่าย.pdf", year: 2025, file: "TSE-SVB-2025-06%20แนวทางการแจ้งปัญหารถใหม่ก่อนการจำหน่าย.pdf",tags: ["รถใหม่", "เคลม"] },
    { title: "TSE-SVB-2025-07 วิธีการบำรุงรักษาและการตรวจสอบแรงดันไอเสียของกรอง DPD.pdf", year: 2025, file: "TSE-SVB-2025-07%20วิธีการบำรุงรักษาและการตรวจสอบแรงดันไอเสียของกรอง%20DPD.pdf",tags: ["DPD", "ระบบไอเสีย", "บำรุงรักษา", "ยูโร 5"] },
    { title: "TSE-SVB-2025-08 ข้อควรระวังในการถอดเครื่องเล่นวิทยุ.pdf", year: 2025, file: "TSE-SVB-2025-08%20ข้อควรระวังในการถอดเครื่องเล่นวิทยุ.pdf",tags: ["ข้อควรระวัง", "วิทยุ"] },
    { title: "TSE-SVB-2025-09 การโปรแกรมข้อมูลเครื่องเล่นวิทยุเมื่อเปลี่ยนเครื่องเล่นวิทยุ", year: 2025, file: "TSE-SVB-2025-09%20การโปรแกรมข้อมูลเครื่องเล่นวิทยุเมื่อเปลี่ยนเครื่องเล่นวิทยุ.pdf",tags: ["GIDSS", "วิทยุ", "โปรแกรม"] },
    { title: "TSE-SVB-2025-10 เปลี่ยนแปลงค่าความตึงมาตรฐาน และขั้นตอนในการปรับตั้งสายพานคอมเพรสเซอร์แอร์สำหรับเครื่องยนต์รุ่น 4JJ3 (TSE)", year: 2025, file: "TSE-SVB-2025-10%20เปลี่ยนแปลงค่าความตึง%20และขั้นตอนในการปรับตั้งสายพานคอมเพรสเซอร์แอร์%20(4JJ3).pdf",tags: ["บำรุงรักษา", "ระบบปรับอากาศ", "4JJ3", "สายพาน", "แรงขัน"] },
];

function renderList(data) {
    const container = document.getElementById("bulletinContainer");
    container.innerHTML = "";

    if (!data.length) {
        container.innerHTML = "<p style='color:red;'>❌ ไม่พบรายการ</p>";
        return;
    }

    const years = [...new Set(data.map(b => b.year))].sort((a, b) => b - a);
    const latestYear = Math.max(...years);

    years.sort((a, b) => b - a);

    years.forEach(year => {
        const groupDiv = document.createElement("div");
        groupDiv.className = "year-group";

        const h2 = document.createElement("h2");
        h2.className = "year-header";
        h2.innerHTML = `${year === latestYear ? "▼" : "▶"} ${year}`;
        h2.style.cursor = "pointer";

        const itemsWrapper = document.createElement("div");
        itemsWrapper.className = "bulletin-items";
        itemsWrapper.style.display = year === latestYear ? "block" : "none";

        h2.addEventListener("click", () => {
            const shown = itemsWrapper.style.display === "block";
            itemsWrapper.style.display = shown ? "none" : "block";
            h2.innerHTML = `${shown ? "▶" : "▼"} ${year}`;
        });

        const getNum = title => {
            const m = title.match(/TSE-SVB-\d{4}-(\d{2})/);
            return m ? parseInt(m[1], 10) : 0;
        };

        data
            .filter(b => b.year === year)
            .sort((a, b) => getNum(b.title) - getNum(a.title))
            .forEach(b => {
                const item = document.createElement("div");
                item.className = "bulletin-item";
                item.innerHTML = `
                    <a href="${b.file}" target="_blank">${b.title}</a>
                    <div class="meta-tags">
                        ${(b.tags || []).map(tag => `<span class="tag" data-tag="${tag}" style="cursor:pointer;">${tag}</span>`).join(" ")}
                    </div>
                `;
                itemsWrapper.appendChild(item);
            });

        groupDiv.appendChild(h2);
        groupDiv.appendChild(itemsWrapper);
        container.appendChild(groupDiv);
    });

    enableTagSearch();
}

function showBackButton() {
    document.getElementById("backBtn").style.display = "block";
}

function hideBackButton() {
    document.getElementById("backBtn").style.display = "none";
}

function setupSearch() {
    const input = document.getElementById("searchInput");
    const btn = document.getElementById("searchBtn");

    function doSearch() {
        const kw = input.value.trim().toLowerCase();
        if (!kw) {
            renderList(bulletins);
            hideBackButton();
            return;
        }
        const filtered = bulletins.filter(b =>
            b.title.toLowerCase().includes(kw) ||
            (b.tags || []).some(t => t.toLowerCase().includes(kw))
        );
        renderList(filtered);
        showBackButton();
    }

    btn.addEventListener("click", doSearch);
    input.addEventListener("keyup", e => {
        if (e.key === "Enter") doSearch();
    });
}

function enableTagSearch() {
    document.querySelectorAll(".tag").forEach(tagEl => {
        tagEl.addEventListener("click", () => {
            const selectedTag = tagEl.dataset.tag.toLowerCase();
            const filtered = bulletins.filter(b =>
                (b.tags || []).some(t => t.toLowerCase() === selectedTag)
            );
            renderList(filtered);
            showBackButton();
        });
    });
}

window.addEventListener("DOMContentLoaded", () => {
    setupTabSwitching();
    renderList(bulletins);
    setupSearch();
    setupAiSearch();
    hideBackButton();

    document.querySelector("#backBtn button").addEventListener("click", () => {
        renderList(bulletins);
        hideBackButton();
    });
});
